[
  {
    "course_code": "DAT695",
    "course_name": "Introduction to data science",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2025-02-24 by Head of Programme (or corresponding).Print pageOverviewSwedish nameIntroduktion till data scienceCodeDAT695Credits7.5 CreditsOwnerMPDSCEducation cycleFirst-cycleMain field of studySoftware Engineering, MathematicsDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingUG - Pass, FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code87141Block scheduleCOpen for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0125 Written and oral assignments4 cGrading: UG4 c0225 Examination3.5 cGrading: UG3.5 c28 Okt 2025 am JDIG13 Jan 2026 pm JDIG28 Aug 2026 pm JDIGIn programmesMPDSC - Data Science and AI, Year 1(compulsory)ExaminerTo personal pageAshkan PanahiDirector of Graduate Studies,Data Science and AI, Computer Science and EngineeringContactashkan.panahi@chalmers.se+46 31 772 11 90To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for bachelor's level (first cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsThe same as for the programme that owns the course.Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA course in programming in a general-purpose language (e.g. C/C++/Java/Python or similar) and/or familiarity with mathematical software like e.g. MATLAB from other courses. One course in mathematics (e.g. calculus, linear algebra, applied mathematical thinking), and one course in mathematical statistics.AimThe course gives a broad introduction to various techniques and theories used in Data Science and AI, with particular focus on their practical applications.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able to:Knowledge and understandingdescribe fundamental types of problems and main approaches in data science and AIgive examples of data science and AI applications from different contextsgive examples of how stochastic models and machine learning (ML) are applied in data science and AIexplain basic concepts in classical AI, and the relationship between logical and data driven, ML-based approaches within AI.briefly explain the historical development of AI, what is possible today and discuss possible future development.Skills and abilitiesuse appropriate programming libraries and techniques to implement basic transformations, visualizations and analyses of example dataidentify appropriate types of analysis problems for some concrete data science applicationsimplement some types of stochastic models and apply them in data science and AI applicationsimplement and/or use AI-tools for search, planning and problem solvingapply simple machine learning methods implemented in a standard libraryJudgement and approachjustify which type of statistical method is applicable for the most common types of experiments in data science applicationsdiscuss advantages and drawbacks of different types of approaches and models within data science and AI.reflect on inherent limitations of data science methods and how the misuse of statistical techniques can lead to dubious conclusionscritically analyze and discuss data science and AI applications with respect to ethics, privacy and societal impact, including diversity, equality, and inclusion.show a reflective attitude in all learningContentDuring the course, a wide selection of methods for Data Science and AI will be introduced. The course is divided into three parts:Introduction to data scienceImplementation of data science solutions, using Python, basic data analysis and visualization.Introduction of the data science process, and appropriate methodology.Examples of core data science methods with case studies such as in clustering, classification and regression.Data science put in context regarding ethics, regulations and limitations, including diversity, equality, and inclusion.Statistical methods for data science and AIIntroduction of some common stochastic models with examples of applications in data science and AI (for instance, naive Bayes classifiers, topic models for text and Hidden Markov Models for sequence data).Artificial IntelligenceIntroduction to classical AI and machine learning, including the relationship to related areas such as algorithms and optimization, and AI philosophy.Examples of methods and applications of AI, in classical AI (search and constraint satisfaction), and ML-based (search engines, naive Bayes and neural networks)Discussion of ethics and societal impact of AI.OrganisationLectures and seminars together with assignments that are done in pairs. Usually there will be one assignment each week.LiteratureLectures and seminars and assignments carried out in pairs. Usually one assignment is given per week.Examination including compulsory elementsThe course has two compulsory parts. One part is examined through compulsory written assignments. The other part is a compulsory written hall exam. Compulsory lectures and seminars may occur and will be stated in the Course PM. Possible grades are Pass and Fail for all parts.To pass the course, all compulsory parts must be passed.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to module:2025-05-13:Digital examChanged to digital exambyExaminator[0225 Examination 3,5 credit] Changed to digital examination insperaChanges to course rounds:2025-05-07:ExaminatorExaminatorchangedfromRocio Mercado (rocom)toAshkan Panahi (ashkanp)byViceprefekt/Adm[Course round 1]",
    "course_type": "compulsory",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT695/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMA947",
    "course_name": "Nonlinear optimisation",
    "description": "Course syllabus adopted 2023-02-14 by Head of Programme (or corresponding).Print pageOverviewSwedish nameOlinjär optimeringCodeTMA947Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studySoftware Engineering, MathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20112Block scheduleA+Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0103 Laboratory1.5 cGrading: UG1.5 c0203 Examination6 cGrading: TH6 c27 Okt 2025 pm J05 Jan 2026 am JIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 1(compulsory elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)TKAUT - Automation and Mechatronics Engineering, Year 3(elective)TKGBS - Global Systems Engineering, Year 3(compulsory elective)TKTEM - Engineering Mathematics, Year 3(elective)ExaminerTo personal pageAxel RinghAssociate Professor,Applied Mathematics and Statistics, Mathematical SciencesContactaxelri@chalmers.se+46 31 772 12 34To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesLinear algebra, analysis in one and several variablesAimThe aim of the course is to give a good theoretical foundation for some of the most important areas of optimisation: convex optimisation, linear optimisation, and nonlinear optimisation. The course treats the basics principles for analyzing the properties of an optimisation problem, and the characterization of feasible points that are (locally) optimal. This theory is used to develop a number of examples of optimisation methods, that can be used to solve instances of practical optimisation problem. The course also aims to give some practical training in mathematical modelling and problem solving using optimisation.Learning outcomes (after completion of the course the student should be able to)The goal is that you, after completing the course, should understand parts of the theory of optimality, duality, and convexity, and their interrelations. In this way, you will be able to analyze many types of optimization problems occurring in practice and both classify them and provide guidelines as to how they should be solved. The latter is the more practical goal of an otherwise mainly theoretical course.More precisely, after completing the course you should be able to:state and explain the most important concepts in convex analysis, convex optimization, and duality, and be able to apply the theory on concrete examples.state and explain the basics of necessary and sufficient optimality conditions, in particular the KKT conditions, and be able to utilize the theory to analyze and solve concrete examples.analyze linear programming problems using concepts such as duality and sensitivity; solve linear programming programs using the simplex method and explain how the method works.explain notions such as descent and feasible direction, and use these concepts to explain the principles behind, to analyze, and to apply classical optimization methods, e.g., steepest descent, variations of Newton's method, the Frank-Wolfe method, and penalty methods; be able to specify conditions under which these methods converge.formulate relevant parts of a real-world problem in terms of a mathematical optimization model, analyze the model using appropriate tools and methods, and apply appropriate solution algorithms.ContentThis basic course in optimization describes the most relevant mathematical principles that are used to analyze and solve optimization problems in continuous variables. A rough separation and overview of the content is as follows.Convex analysis:convex set, polytope, polyhedron, cone, representation theorem, extreme point, Farkas Lemma, convex functionOptimality conditions and duality:global/local optimum, existence and uniqueness of optimal solutions, variational inequality, Karush-Kuhn-Tucker (KKT) conditions, complementarity conditions, Lagrange multiplier, Lagrangian dual problem, global optimality conditions, weak/strong dualityLinear programming (LP):LP models, LP algebra and geometry, basic feasible solution (BFS), the Simplex method, LP duality, optimality conditions, strong duality, complementarity, interior point methods, sensitivity analysisNonlinear optimization methods:direction of descent, line search, (quasi-)Newton methods, Frank--Wolfe method, gradient projection, exterior and interior penalty methods.OrganisationLectures, exercises, two computer exercises, and a project assignment that comprises mathematical modelling and the solution of a concrete optimization problem med industrial relevance. Additionally, there might be voluntary elements that could give bonus points for the written final exam.Literature\"An Introduction to Continuous Optimization\", by Niclas Andréasson, Anton Evgrafov, and Michael Patriksson, with Emil Gustavsson, Zuzana Nedělková, Kin Cheong Sou, and Magnus Önnheim, third edition, published by Studentlitteratur in 2016.Examination including compulsory elementsProject assignment (laboratory), computer exercises, a written final exam. There might be voluntary elements that could give bonus points for the written final exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "compulsory",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMA947/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT246",
    "course_name": "Empirical software engineering",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2021-02-17 by Head of Programme (or corresponding).Print pageOverviewSwedish nameEmpirisk programvaruteknikCodeDAT246Credits7.5 CreditsOwnerMPSOFEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code24117Maximum participants80(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0114 Written and oral assignments2.5 cGrading: UG2.5 c0214 Examination5 cGrading: TH5 c27 Okt 2025 pm JDIG08 Jan 2026 am JDIG25 Aug 2026 am JDIGIn programmesMPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPHPC - High-performance Computer Systems, Year 2(elective)MPIDE - Interaction Design and Technologies, Year 2(elective)MPSOF - Software Engineering and Technology, Year 1(compulsory)ExaminerTo personal pageRichard TorkarHead of Department,Computer Science and EngineeringContactrichard.torkar@chalmers.se+46 31 772 57 19To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible for the course Empirical Software Engineering the student should have a bachelor degree in Software Engineering, Computer Science or equivalent.AimSoftware development organizations need to constantly improve to become faster, better, and more efficient. This course aims to learn scientific approaches, in particular experiments and statistics, for data collection e.g. as a basis for analysis and decision support in initiatives to improve performances in software development organizations. The course prepares students for the master thesis project and improves the students ability to conduct PhD studies.Learning outcomes (after completion of the course the student should be able to)Knowledge and understanding:Describe, understand, and apply empiricism in software engineeringDescribe, understand, and partly apply the principles of case study research/experiments/surveys.Describe and understand the underlying principles of meta-analytical studies.Explain the importance of research ethics.Recognise and define code of ethics for when conducting research in software\r\nengineering.State and explain the importance of threats to validity and how to control\r\nsaid threats.Describe and explain the concepts of probability space (incl. conditional probability), random variable, expected value and random processes, and know a number of concrete examples of the concepts.Describe Markov chain Monte Carlo methods such as Metropolis.Describe and explain Hamiltonian Monte Carlo.Explain and describe multicollinearity, post-treatment bias, collider bias, and confoundingDescribe and explain ways to avoid overfittingSkills and abilities:Assess suitability of and apply methods of analysis on dataAnalyse descriptive statistics and decide on appropriate analysis methods.Use and interpret code of ethics for software engineering research.Design statistical models mathematically and implement said models in a programming language.Make use of random processes, i.e., Bernoulli, Binomial, Gaussian, and Poisson distributions, with over-dispersed outcomes.Make use of ordered categorical outcomes (ordered-logit) and predictorsAssess suitability of, from a ontological (natural process) and epsitemological (maxent) perspective, various statistical distributionsMake use of and assess directed acyclic graphs to argue causalityJudgement and approach:State and discuss the tools used for data analysis and, in particular, judge their output.Judge the appropriateness of particular empirical methods and their applicability to attack various and disparate software engineering problems.Question and assess common ethical issues in software engineering research.Assess diagnostics from Hamiltonian Monte Carlo and quadratic approximation using information theoretical concepts, i.e., information entropy, WAIC, and PSIS-LOO.Judge posterior probability distributions for out of sample predictions and conduct posterior predictive checks.ContentThis course is for students who are interested in the empirical methods applied to the field of software engineering. The course introduces quantitative and qualitative methods in software engineering with accompanying statistical methods used for analysis.The course contains:Descriptive and inferential statistical methods applied to software engineering.Conducting qualitative and quantitative methods in software engineering.Methods for analysing quantitative and qualitative data in software engineering.Usage of statistical tools.OrganisationThe course introduces quantitative and qualitative methods in software engineering research with accompanying statistical methods used for analysis.The course contains: Descriptive and inferential statistical methods applied to software engineering. Conducting qualitative and quantitative methods in software engineering. Methods for analysing quantitative and qualitative data in software engineering. Usage of statistical tools.LiteratureWe will use different textbooks and research articles for different parts. More information will be given before the course starts.Examination including compulsory elementsThe examination will be conducted through an individual assignment. The assignment is theoretical and practical in its nature.Additionally, a written hall exam is part of the examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to module:2025-09-17:Digital examChanged to digital exambyExaminator[0214 Examination 5,0 credit] Changed to digital examination inspera",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT246/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT441",
    "course_name": "Advanced topics in machine learning",
    "description": "Course syllabus adopted 2024-02-05 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAvancerade teman i maskininlärningCodeDAT441Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87127Maximum participants100Block scheduleBOpen for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0124 Written and oral assignments3.5 cGrading: TH3.5 c0224 Examination4 cGrading: TH4 c27 Okt 2025 am JDIG08 Jan 2026 pm JDIG17 Aug 2026 pm JDIGIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(compulsory elective)MPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)ExaminerTo personal pageMorteza Haghir ChehreghaniProfessor,Data Science and AI, Computer Science and EngineeringContactmorteza.chehreghani@chalmers.se+46 31 772 64 15To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible for the course, a student must have passed a minimum of the following courses:7.5 credits of programming (Python experience desirable but not absolutely required)7.5 credits of a data structures and/or algorithms7.5 credits of basic probability and statistics7.5 credits of calculus7.5 credits of linear algebra7.5 credits of basic machine learning (for example TDA233, MVE440, DAT340)AimThis course will focus on advanced topics in machine learning, in order to provide a deep understading of the modern machine learning areas. The students will learn sophisticated machine learning models which are commonly used in real-world applications, and also will learn how to analyze and understand in depth the advanced machine learning models.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able: to learn about modern and advanced machine learning methods and analyze them in different situations to read and understand state-of-the-art scientific articles in the field to propose and employ suitable models for the complex machine learning tasks to be prepared for research and development of advanced machine learning methodsKnowledge and understanding to understand in depth the advanced machine learning methods, and learn their practical implications to understand some of the main research areas and topics within machine learning to learn the way the complex real problems are turned into research questions in machine learningCompetence and skills to analyze advanced machine learning and understand why a method may work or may fail to deal with the cases where the standard machine learning is not very helpful and needs to be improved to be better prepared for research in AI/machine learning to read and follow the relevant state-of-the-art research articlesJudgement and approach to employ a suitable model w.r.t. the assumptions and analyze the different aspects such as performance and effectiveness to learn how machine learning models can be further developed to satisfy the requirements to distinguish some of the main research areas in machine learning, the corresponding challenges and the current approaches to solve themContentThe course is focused on advanced theory, methods and mathematics of machine learning.The course content is the following: Theoretical machine learning and the computational aspects Sequential decision making Online learning/Active learning/Multi-armed bandits Markov decision processes Reinforcement learning Relevant advanced deep learning (Deep Neural Network) modelsOrganisationLectures and assignments.LiteratureSee course homepage.Examination including compulsory elementsThe course is examined by assignments and a written hall examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT441/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT465",
    "course_name": "Causality and machine learning",
    "description": "Course syllabus adopted 2024-02-01 by Head of Programme (or corresponding).Print pageOverviewSwedish nameKausalitet och maskininlärningCodeDAT465Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software Engineering, MathematicsDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1The course round is cancelled.For further questions, please contact the director of studiesTeaching languageEnglishApplication code87131Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0121 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)ExaminerTo personal pageFredrik JohanssonAssociate Professor,Data Science and AI, Computer Science and EngineeringContactfredrik.johansson@chalmers.se+46 31 772 10 93To personal pageEligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA course in programming in a general-purpose language (e.g. C/C++/Java/Python). One course each in calculus, linear algebra and mathematical statistics. We strongly recommend that the student has taken a course in Machine learning, for example DAT340, TDA233 or similar, or that such a course is taken in parallel alongside this course. If you have completed the prerequisites but feel that you may need a refresher, make sure to be comfortable with basic definitions and properties of random variables, probability distributions and densities, expectations and basic linear algebra such as matrix and vector products and norms.AimThe aim for this course is to give knowledge and understanding of causality and causal inference from a mathematical, statistical and computational perspective. It should also provide the tools necessary for solving causal inference problems in practical applications.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able to:Knowledge and understandingProvide an overview over different frameworks for causality and causal inferenceDescribe important causal problems and give examples of their applicationsExplain how problems of causal inference differs from other types of (statistical) inference problemsAccount for common approaches to causal inference and the conditions under which they are accurateSkills and abilitiesIdentify different types of causal inference problems in real-world applicationsAnalyze causal inference problems and estimate the plausibility of solving them under certain conditionsImplement and apply methods for causal inference appropriate for specific problemsJudgement and approachDiscuss pros and cons of different frameworks for causality and causal inferenceReflect over the fundamental limitations to the possibility of causal identificationCritically analyse and discuss research and applications of causal inference, in particular with respect to adjustment for confounding factorsContentThe content is structured into 8 modules, one for each week of the course. We begin by briefly covering necessary prerequisites, such as probabilistic graphical models, and by introducing structural definitions of causality. This will enable us to study sufficient conditions for inferring causal relationships between random variables. In the second half of the course, we study estimation of causal effects and policy evaluation. These are important topics in, e.g., epidemiology. At the end of the course, each student will present a research paper on a topic of their choice.Probabilistic graphical modelsCausalityStructural causal models (SCM)Causal structure learningNeyman-Rubin causal model (potential outcomes)Observational studiesPolicy evaluationMediation analysisOrganisationModules composed of lectures, follow-up sessions and hand-in assignments. Follow-up sessions are interactive meetings focused on problem solving and advanced aspects of the module topic. The course concludes with research paper presentations by students.LiteratureThe course will be based on public material such as research papers and ebooks available online. There will be weekly in-class or video lectures given by an instructor. If you would like to read a textbook on the subject, consider one of the following:- Pearl, Judea. Causality. Cambridge university press, 2009.- Hernán MA, Robins JM (2020). Causal Inference: What If. Boca Raton: Chapman & Hall/CRC. https://www.hsph.harvard.edu/miguel-hernan/causal-inference-book/- Morgan, Stephen L., and Christopher Winship. Counterfactuals and causal inference. Cambridge University Press, 2015. 2nd Edition.Examination including compulsory elementsAssignments and paper presentations.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT465/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT625",
    "course_name": "Structured machine learning",
    "description": "Course syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStrukturerad maskininlärningCodeDAT625Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87132Maximum participants25(at least 10% of the seats are reserved for exchange students)Minimum participants5Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0124 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)ExaminerTo personal pageSimon OlssonAssociate Professor,Data Science and AI, Computer Science and EngineeringContactsimonols@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesExperience of Python programming is essential, prior experience with a modern machine learning library is highly recommended.Knowledge equivalent to at least three of the following course's content:Linear algebra (7.5 credits), numerical mathematics or scientific computing (7.5 credits), calculus (7.5 credits), or statistical mechanics/thermodynamics (7.5 credits).One course in computational or mathematical statistics (7.5 credits) and one in machine learning (7.5 credits).Students are recommended to take the course in second year of their master's program.AimThe aim of the course is to familiarize students with the use of structure of data, and data generating processes, and how this information can be used to inform machine learning architecture design and training.The course focuses on building a strong understanding of the underlying concepts and applying them in a practical setting. There will be a particular focus on applications in natural sciences.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingDefine core concepts such as geometric priors, equivariance, and probability flow generative models.Identify key structural properties (e.g., symmetries, invariances) in data and their domains.Explain how geometric deep learning (GDL) architectures (e.g., graph neural networks [GNN]) encode domain-specific structure.Summarize the mathematical principles underlying probability flow generative models, such as measure transport and change of variables.Interpret the role of inductive biases (e.g., locality, symmetry) in model design for scientific applications.Skills and abilitiesImplement geometric deep learning architectures (e.g., GNNs) using frameworks like PyTorch Geometric.Implement and simulate probability flow generative models (e.g., diffusion models or continuous normalizing flows) subject to certain domain symmetries.Compare the trade-offs between equivariant architectures (e.g., invariant vs. equivariant layers) in terms of expressivity, computational cost, and sample complexity.Judgment and approachJudge recent scientific reports on machine learning research projects using structure in data or data generating process.Propose a small-scale research project that builds-on or applies upon themes covered in the course.Appraise small-scale research projects within structured machine learning using structure in data or data generating process.ContentThis course will equip students with the theoretical foundations and practical tools to design machine learning systems that exploit structural patterns inherent indata domains,datasets, andgenerative processes. The course introducesgeometric deep learningandprobability flow generative models(e.g., continuous normalizing flows and diffusion models), and through practical exercises students will learn to build models that respect domain-specific constraints, such as invariance and equivariance to transformations or conservation laws.The course bridges rigorous mathematical principles¿such as geometric priors, stochastic differential equations, and symmetry-aware architectures¿with hands-on implementation for real-world challenges. A key emphasis is placed on applications innatural sciences(e.g., molecular modeling), where structured data and generative processes are central to solving open problems.The course will integrates theoretical lectures with assignments. The course will cover the following broad themes:Geometric Deep Learning (GDL):We will show how many modern Deep learning architectures, including Transformers, convolutional neural networks, and graph neural networks, emerge naturally from the GDL framework.Key concepts:- Learning in high-dimensional spaces, sample complexity, geometric priors, scale separation, symmetry, invariance/equivariance, deformation stability.Data Generating processess and Probability flow generative models:We discuss specific considerations about the data generation and acquisition/collection. We will give a brief introduction to generative modeling broadly and focus more specifically on diffusion models and continuous normalizing flows.Key concepts:- Direct/indirect observation, independent/correlated data, averaging/aliasing, density estimation, latent space, measure transport, push-forward, diffeomorphismsApplications:The course will focus on molecular applications as they provide a natural platform to illustrate all the concepts covered in the course.  Three projects will cover supervised  (classification, regression) and unsupervised learning (density estimation). The course ends with an essay assignment where a small-scale research project is proposed based on themes covered in the course.This is not a model-zoo course: the course focuses on theoretical and conceptual understanding and how it relates practical implications. The course makes extensive use of high-dimensional calculus and linear algebra. The course also includes a crash-course in abstract algebra (group theory and group representation theory)LiteratureLecture notes/hand-outs. Primary literature.Examination including compulsory elementsHand-ins, take-home projects, peer-assessment and essay assignment.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT625/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "EEN100",
    "course_name": "Statistics and machine learning in high dimensions",
    "description": "Course syllabus adopted 2023-02-02 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStatistik och maskininlärning i högre dimensionerCodeEEN100Credits7.5 CreditsOwnerMPICTEducation cycleSecond-cycleMain field of studyElectrical Engineering, Software Engineering, MathematicsDepartmentELECTRICAL ENGINEERINGGradingUG - Pass, FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code90117Maximum participants60(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Oral examination6 cGrading: UG6 c0220 Project1.5 cGrading: UG1.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)ExaminerTo personal pageGiuseppe DurisiFull Professor,Communication, Antennas and Optical Networks, Electrical EngineeringContactdurisi@chalmers.se+46 31 772 18 02To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA solid foundation in probability and calculusAimThe explosion in the volume of data collected in all scientific disciplines and in industry requires students interested in statistical analyses and machine-learning and signal-processing algorithms to acquire more sophisticated probability tools than the ones taught in basic probability courses.This course provides an introduction to the area of high-dimensional statistics, which deals with large scale problems where both the number of parameters and the sample size is large.The course covers fundamental tools for the analysis of random vectors, random matrices and random projections, such as tail bounds and concentration inequalities.It further provides concrete applications of such tools in the context of generalization-error analyses in statistical learning theory, sparse linear model, and matrix models with rank constraints.Learning outcomes (after completion of the course the student should be able to)State basic tails and concentration bounds for sums of independent random variablesApply these bounds to provide guarantees on how accurately one canestimate a covariance matrix from datarecover a sparse linear vector from noisy linear projectionsestimate a low-rank matrix from few of its entriesContentFundamental probability toolsPreliminaries on random variables: classical inequalities and limit theoremsConcentration of sums of independent random variables: Hoeffding, Chernoff, Bernstein, sub-Gaussian and sub-exponential distributionsRandom vectors and random matrices in high dimensionsApplications in machine learning, statistics, and signal processingCovariance matrix estimationRecovery of sparse signalsPrincipal component analysis and community detectionLow-rank matrix recoverySample complexity in statistical learning theoryOrganisationApproximately 16 lectures, 4 exercise sessions, and 3 projects where the tools learnt in the course will be used to solve a real-world machine-learning taskLiteratureThe course will be partly based on the following referencesR. Vershynin, High-dimensional probability: an introduction with applications in data science. Cambridge Univ. Press, 2019. Available:OnlineM. J. Wainwright, High-dimensional statistics: a nonasymptotic viewpoint. Cambridge, U.K.: Cambridge Univ. Press, 2019.Bandeira, Singer, and Strohmer, Mathematics of Data Science, Jun. 2020, draft 0.1. Available onlineFoucart and Rauhut, A mathematical introduction to compressive sensing, 2013. Available online through Chalmers libraryShalev-Shwartz and Ben-David, Understanding machine learning: from theory to algorithms. Cambridge, U.K.: Cambridge Univ. Press, 2014. Available online through Chalmers libraryExamination including compulsory elementsOral exam and project (pass or fail)The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/EEN100/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "FFR105",
    "course_name": "Stochastic optimization algorithms",
    "description": "Course syllabus adopted 2024-01-31 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStokastiska optimeringsmetoderCodeFFR105Credits7.5 CreditsOwnerMPCASEducation cycleSecond-cycleMain field of studyBioengineering, Chemical Engineering, Engineering PhysicsDepartmentMECHANICS AND MARITIME SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code11120Maximum participants200(at least 10% of the seats are reserved for exchange students)Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0199 Examination7.5 cGrading: TH7.5 c29 Okt 2025 am J05 Jan 2026 am J27 Aug 2026 am JIn programmesMPAME - Applied Mechanics, Year 2(elective)MPCAS - Complex Adaptive Systems, Year 1(compulsory)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pageMattias WahdeFull Professor,Vehicle Engineering and Autonomous Systems, Mechanics and Maritime SciencesContactmattias.wahde@chalmers.se+46 31 772 37 27To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic programming and courses in linear algebra and mathematical analysis or correspondingAimThe aim of the course is for the students to attain basic knowledge of new methods in computer science inspired by evolutionary processes in nature, such as genetic algorithms, genetic programming, and artificial life. These are both relevant to technical applications, for example in optimization and design of autonomous systems, and for understanding biological systems, e.g., through simulation of evolutionary processes.Learning outcomes (after completion of the course the student should be able to)Implement and use several different classical optimization methods, e.g. gradient descent and penalty methods.Describe and explain the basic properties of biological evolution, with emphasis on the parts that are relevant for evolutionary algorithms.Define and implement different versions of evolutionary algorithms, particle swarm optimization, and ant colony optimization, and apply the algorithms in the solution of optimization problems.Compare different types of biologically inspired computation methods and identify suitable algorithms for a variety of applications.ContentThe course consists of the following topics:\r\n- Classical optimization methods. Gradient descent. Convex functions. The lagrange multiplier method. Penalty methods.\r\n- Evolutionary algorithms. Fundamentals of genetic algorithms, representations, genetic operators, selection mechanisms. Theory of genetic algorithms. Analytical properties of evolutionary algorithms. (Linear) genetic programming: representation and genetic operators.\r\n- Particle swarm optimization. Fundamentals and applications.\r\n- Ant colony optimization. Fundamentals and applications.\r\n- Comparison of the different algorithms. Ethical aspects of machine learningOrganisationThe course is organized as a series of lectures. Some lectures are devoted to problem-solving.LiteratureWahde, M. Biologically inspired optimization methods: An introductionExamination including compulsory elementsThe examination is based on a written exam (50 %) and compulsory home problems (50 %).The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/FFR105/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "FFR135",
    "course_name": "Artificial neural networks",
    "description": "Course syllabus adopted 2025-02-13 by Head of Programme (or corresponding).Print pageOverviewSwedish nameArtificiella neurala nätverkCodeFFR135Credits7.5 CreditsOwnerMPCASEducation cycleSecond-cycleMain field of studyBioengineering, Chemical Engineering, Engineering PhysicsDepartmentPHYSICSGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code11126Maximum participants200(at least 10% of the seats are reserved for exchange students)Block scheduleBOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0100 Examination7.5 cGrading: TH7.5 c27 Okt 2025 am J07 Jan 2026 pm J20 Aug 2026 pm JIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pageBernhard MehligFull Professor,Institution of physics at Gothenburg UniversityContactbernhard.mehlig@physics.gu.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesAnalysis in one variable, linear algebra, basic skills in analysis in several variables, and programming.AimThis course describes how neural networks are used in machine learning. Neural networks are distributed computational models inspired by the structure of the human brain, consisting of many simple processing elements that are connected in a network. Neural networks have revolutionised how we solve important problems in the engineering sciences, such as image analysis (object recognition and location), prediction, and control. The course gives an overview and a basic understanding of currently used neural-network algorithms, and exhibits similarities as well as differences between these methods. The main emphasis of this introductory course is on three connected topics: recurrent (Hopfield) networks, supervised learning with deep neural networks, and unsupervised learning (reinforcement learning). The goal is to explain how and why the algorithms work, when and how they fail, how to program the standard methods from scratch, and how to use packages that allow to easily set up and to efficiently run larger networks.Learning outcomes (after completion of the course the student should be able to)-distinguish between supervised and unsupervised learning, explain the key principles of the corresponding algorithms, understand differences and similarities-understand under which circumstances neural-net algorithms are the method of choice-understand and explain strengths and weaknesses of the neural-net algorithms-implement the algorithms introduced in class on a computer, both from scratch and using neural-net packages-interpret the results of computer simulations and communicate conclusions in a clear, logical, and concise fashion-understand the historical development of the field of machine learning with neural networks-To have insights on ethical questions posed by machine learning, as well as possible risks, especially as related to gender and ethnicity-To have an appreciation of the challenges and opportunities of working in an intercultural settingContentThe course is based onMachine learning with neural networkshttps://arxiv.org/abs/1901.05639.1. Statistical mechanics of neural netsMcCulloch-Pitts neurons, Hopfield nets, stochastic optimisation, Boltzmann machines2. Deep learningPerceptrons, backpropagation, stochastic gradient descent, deep learning, recurrent nets3. Unsupervised learningHebbian learning, radial basis-function nets, reinforcement learningOrganisationLecturesHomework problemsProgramming with programming language of choice (commonly matlab or python). We use OpenTA for the homework problems.Exercise classesHomework problems and exam questionsGuest lecturesFrom research and/or industry, possibilities for MSc thesesShort instruction videosLiteratureCourse bookB. Mehlig,Machine learning with neural networkshttps://arxiv.org/abs/1901.05639Additional referencesI. Goodfellow, Y. Bengio & A. Courville,Deep Learninghttps://www.deeplearningbook.orgJ. Hertz, A. Krogh & R. G. Palmer,Introduction to the theory of neural computation, Addison-Wesely, Redwood City (1991).S. Haykin,Neural Networks: a comprehensive foundation, 2nd ed., Prentice Hall, New Jersey (1999)R.S. Sutton & A. Barto,Reinforcement learning: An Introduction, 2nd ed., MIT Press,http://www.incompleteideas.net/book/the-book-2nd.htmlExamination including compulsory elementsThe final grade is based on homework assignments (50%) as well as on a written examination (50%). To pass the course one must obtain points on both the exam and the homework assignments, of which a minimum number of points is required on the written exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/FFR135/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE188",
    "course_name": "Computational methods for Bayesian statistics",
    "description": "Course syllabus adopted 2024-02-05 by Head of Programme (or corresponding).Print pageOverviewSwedish nameBeräkningsmetoder för Bayesiansk statistikCodeMVE188Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20135Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0124 Project2 cGrading: UG2 c0224 Examination5.5 cGrading: TH5.5 c30 Okt 2025 pm J08 Jan 2026 pm JIn programmesMPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)ExaminerTo personal pagePetter MostadProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmostad@chalmers.se+46 31 772 35 79To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic skills in mathematical statistics.Basic skills in scientific programming (for example in Python, Matlab or R) as achieved by completing TMS150 \"Stochastic Data Processing and Simulation\".AimIn Bayesian statistical analysis and decision theory, calculating exact results is often intractable due to the complexity of the involved models and their parameter spaces. This course aims at equipping the student with practical and theoretical skills for utilizing computationally intensive methods to solve such tasks, in particular in the form of stochastic simulations.A special effort will be made to help the student to see the connections and interplay between statistical modeling and applied problem solving, as well as computational and theoretical aspects of the models.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able toexplain and apply a Bayesian approach to probability inference,implement important computational algorithms for Bayesian inference, for example Metropolis-Hastings MCMC,make independent and informed decisions about statistical modeling andcomputational choices,present his or her analysis in a structured and pedagogical way.ContentModels representing uncertain knowledgeConstructing Bayesian Networks for modelling uncertaintyPrediction using basic analytic and numerical methods and with the EM algorithmPrediction using sampling methods, for example Markov chain Monte Carlo (MCMC)Sequential models, including, e.g., particle filtersComputation with graphical modelsVariational Bayes approximationsApproximate Bayesian Computing (ABC)Decision theoryOrganisationLectures and obligatory computer based hand-in assignments.LiteratureLiterature written for the course, as well as links to some supporting literature, will be available via the course Canvas pageExamination including compulsory elementsCompulsory computer based hand-in assignments. The grade will be based on a written examination at the end of the course.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE188/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "RRY025",
    "course_name": "Image processing",
    "description": "Course syllabus adopted 2023-01-31 by Head of Programme (or corresponding).Print pageOverviewSwedish nameBildbehandlingCodeRRY025Credits7.5 CreditsOwnerMPWPSEducation cycleSecond-cycleMain field of studyElectrical Engineering, Engineering PhysicsDepartmentSPACE, EARTH AND ENVIRONMENTGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code29112Maximum participants65(at least 10% of the seats are reserved for exchange students)Block scheduleCOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0107 Examination7.5 cGrading: TH7.5 c30 Okt 2025 pm J07 Jan 2026 pm J21 Aug 2026 pm JIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPHPC - High-performance Computer Systems, Year 2(elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)MPMED - Biomedical Engineering, MSc Progr, Year 2(elective)MPWPS - Wireless, Photonics and Space Engineering, Year 2(elective)ExaminerTo personal pageJouni KainulainenAssociate Professor,Astronomy and Plasma Physics, Space, Earth and EnvironmentContactjouni.kainulainen@chalmers.se+46 31 772 64 23To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesMathematical analysis in several variables and statistics, and experience with Matlab.AimThe aim of this course is for students to become familiar with a wide variety of techniques in modern Image Processing. These techniques can be used to subjectively improve image  quality for the end-user (image enhancement), remove known image distortions (image restoration) and to reduce image data sizes for storage or transmission (image compression). These techniques are valuable in a range of applications and careers including, but not limited to, medical imaging, astronomy, remote sensing, automation etc. Stress is placed on deep understanding of the principles underlying the techniques rather than memory learning of algorithms.Learning outcomes (after completion of the course the student should be able to)Visualise via means of mental images the process of forming 1D and 2D Fourier transforms and also the convolution process. Describe the similarities and differences between the continuous and discrete Fourier transforms and their inter-relationship.Select and apply appropriate image enhancement methods for different applications. Discriminate between cases where automated image enhancement methods produce appropriate results and where they do not.Understand the differences between averaging and median filtering for reducing image noise.Demonstrate understanding of image smoothing and sharpening in both the image and Fourier domains. Select between optimum methods of edge detection in different applications.Describe common distorted images as convolutions of the true image with point spread functions (PSF). Describe and decide under which conditions different image restoration algorithms can be used and describe the strengths and weakness of these algorithms.Describe the Cosine transform and its relationship to the Fourier transform.Demonstrate a basic understanding of wavelets and know how to use them to compress and denoise data.Explain the difference between lossy and lossless compression methods and explain the concept of data redundancy as the source of compression. Describe the subcomponents of general compressor/decompressor algorithms. Calculate theoretical limits to lossless compression using the Shannon noiseless coding theorem and implement Huffman coding.Describe a variety of different mapping functions that can be used to obtain compression and decide when different methods are appropriate. Show via examples why Digital Pulse Code Modulation (DPCM) works and is stable in the face of quantisation errors.Describe the main components of the JPEG standard.Write computer code in MATLAB to implement selected image processing algorithms.ContentIntroduction.  Image Enhancement: transform functions, and histogram, equalisation; image smoothing and sharpening; edge detection and noise reduction; Fourier domain methods.  Continuous and Discrete 2D Fourier Transforms.  Wavelets and Wavelet Applications.  Image Compression: general compressor/decompressor, coding theorem, Huffman coding and multi-pixel coding; run length coding, predictive coding and digital pulse code modulation; cosine transform, block coding, zonal mask and threshold mask; JPEG.  Image Restoration: linear space-invariant distortions, point spread function, inverse and pseudoinverse filters; Wiener filter; image reconstruction from projections.OrganisationLectures, lab exercises, problem classes and project.Literature'Digital Image Processing' 4th edition (2018) by Gonzalez and Woods.Examination including compulsory elementsProject and written exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "credits": 25.0,
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/RRY025/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "SSY340",
    "course_name": "Deep machine learning",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2025-02-20 by Head of Programme (or corresponding).Print pageOverviewSwedish nameDjup maskininlärningCodeSSY340Credits7.5 CreditsOwnerMPSYSEducation cycleSecond-cycleMain field of studyAutomation and Mechatronics Engineering, Computer Science and Engineering, Electrical Engineering, Software Engineering, Biomedical engineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code35132Maximum participants250(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0117 Project3 cGrading: TH3 c0217 Written and oral assignments4.5 cGrading: TH4.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(compulsory elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)MPMED - Biomedical Engineering, MSc Progr, Year 2(compulsory)MPSYS - Systems, Control and Mechatronics, Year 1(compulsory elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pageLars HammarstrandProfessor,Signal Processing and Biomedical Engineering, Electrical EngineeringContactlars.hammarstrand@chalmers.se+46 31 772 17 88To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesStudents should have working knowledge of basic probability, linear algebra and programming. It is desirable to have basic knowledge in statistics and learning, corresponding to, e.g., ESS101 Modelling and simulation, SSY230 System identification or TDA233 Algorithms for machine learning and inference, but it is not a strict requirement.AimThe purpose with this course is to give a thorough introduction to deep machine learning, also known as deep learning or deep neural networks. Over the last few years, deep machine learning has dramatically changed the state of the art performance in various fields including speech-recognition, computer vision and natural language processing. We focus primarily on basic principles regarding how these networks are constructed and trained, but we also cover many of the key techniques used in different applications. The overall objective is to provide a solid understanding of how and why deep machine learning is useful, as well as the skills to apply them to solve problems of practical importance.Learning outcomes (after completion of the course the student should be able to)After the course, students should be able to:explain the fundamental principles of supervised learning, including strategies to use validation data to avoid overfittingdescribe the standard cost functions optimised during supervised training (in particular the cross entropy) and the standard solution techniques (stochastic gradient descent, back propagation, etc)explain how traditional feed-forward networks are constructed and why they can approximate almost any function (the universality theorem)understand the problem with vanishing gradients and modern tools to mitigate it (e.g., batch normalisation and residual networks)summarise the key components in a convolutional neural networks (CNNs) and their key advantagesdescribe common types of recurrent neural networks (RNN) and their applicationssummarise how transformers are constructed and describe their key propertiesprovide an overview of some of the many modern variations of the deep learning networksargue for the benefits with transfer learning, self-supervised learning and semi-supervised learning when we have a limited amount of annotated/labeled datatrain and apply CNNs to image applications and RNNs or transformers to applications related to time sequencesuse a suitable deep learning library (primarily PyTorch) to solve a variety of practical applicationsContentsupervised learning by cross entropy minimisation combined with evaluations on validation databack propagation and stochastic gradient descenta suitable programming language for implementing deep learning algorithmfeedforward neural networks and convolutional neural networksrecurrent neural networksthe transformer architecturetechniques for efficient training such as momentum and batch normalisationmodern variations of neural networks (e.g., attention and residual networks)self-supervised learning and semi-supervised learningapplication of convolutional neural networks on image recognition and transformers for sequential problemsOrganisationThe course comprises on-line lectures (to watch before the class), active learning sessions (where we review material from the corresponding lecture), assignments, a project and tutorial sessions.LiteratureWe mainly use\r\nIan Goodfellow, Yoshua Bengio and Aaron Courville, Deep Learning, MIT Press, 2016,\r\nwhich is available online http://www.deeplearningbook.org.Examination including compulsory elementsThe students are evaluated individually based on their performance in the different activities in the course; more specifically, the grade is obtained by weighting the results on hand-ins, a project, and the degree of attendance. The grade is also based on the performance on small tests used to evaluate what the students have learned from the activities in the course.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to course rounds:2025-05-20:ExaminatorExaminatorchangedfromLennart Svensson (pale)toLars Hammarstrand (e8rull)byViceprefekt[Course round 1]",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/SSY340/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TIN093",
    "course_name": "Algorithms",
    "description": "Course syllabus adopted 2023-02-04 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAlgoritmerCodeTIN093Credits7.5 CreditsOwnerMPALGEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1Course round 2EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code02139Maximum participants135(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0114 Examination7.5 cGrading: TH7.5 c25 Okt 2025 pm J27 Aug 2026 pm JIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(compulsory)MPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPEES - Embedded Electronic System Design, Year 2(elective)ExaminerTo personal pageBirgit GroheInstructor,Data Science and AI, Computer Science and EngineeringContactbirgit.grohe@cse.gu.se+46 31 772 20 37To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code02137Maximum participants100(at least 10% of the seats are reserved for exchange students)Block scheduleA+Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0114 Examination7.5 cGrading: TH7.5 cIn programmesMPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPSOF - Software Engineering and Technology, Year 1(compulsory elective)MPSOF - Software Engineering and Technology, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 1(elective)TKDAT - Computer Science and Engineering, Year 3(elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pagePeter DamaschkeFull Professor,Data Science and AI, Computer Science and EngineeringContactptr@chalmers.se+46 31 772 54 05To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesParticularly relevant are an introductory course in data structures and knowledge in discrete mathematics.AimThe algorithms course revolves around three central questions that appears naturally when one wants to use a computer to compute a problem:Is the problem computationally solvable at all?How can we do it?How fast can the solution be?The course shall provide basic knowledge and methods to answer these types of question as precisely as possible, and improve the ability to write fast and well-founded programs.Other important aspects are: to improve the intuitive sense of time complexity of problems and algorithms in general, to show how the choice of data structures can influence speed of a program, and how data structures must be adapted to algorithms.The most important goal of the course is to give general principles of creating good algorithms for new problems for which you cannot find any published algorithm.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingdescribe your algorithms and their qualities: explain algorithms in writing, so that others can understand how they work, why they are correct and fast, and where they are useful.recognize that non-trivial computational problems, which need to be solved by algorithms, appear in various real-world computer applications and to formalize them.intractability: recognize intractable problems and other classes of problems like P, NP, NPC.prove the correctness of algorithms.Skills and abilitiesdesign: apply the main design techniques for efficient algorithms (for instance greedy, dynamic programming, divide-and-conquer) to problems which are similar to the textbook examples but new.perform the whole development cycle of algorithms: problem analysis, choosing, modifying and combining suitable techniques and data structures, analysis of correctness and complexity, filling in implementation details, looking for possible improvements, etc.perform simple reductions between problems, explain NP completeness, recognize various computationally hard problems which tend to appear over and over again in different applications.Judgement and approachcritically assess algorithmic ideas and demonstrate the ability to resist the temptation to create obvious and seemingly plausible algorithms (which often turn out to be incorrect).analyse: explain why the time efficiency of algorithms is crucial, express the time complexity in a rigorous and scientifically sound manner, analyze the time complexity of algorithms (sum up operations in nested loops, solve standard recurrences, etc.) i.e. perform an objective evaluation of the performance and be able to compare it to other algorithms performance.However, be aware that this is not a course in programming! The main focus is on the design of algorithms from a given problem specification and the analysis of efficiency of these algorithms. This is, so to speak, the analytical work that has to be done before writing any line of code, if one wants to solve a new problem with the help of computers.ContentThe course topics are as follows:Introduction. What is an efficient algorithm?Tools for analysis of algorithms. O-notation. Analyzing loops and recursive calls. Solving recurrences.Data structures and algorithms. Review of basic data structures.Combining data structures. Merge-and-find.Graph algorithms.Greedy algorithms.Divide-and-conquer.Dynamic programming.Basic complexity theory. Complexity classes P, NP, and NPC, reductions. Examples of NP-complete problems. Coping with hard problems.OrganisationThe course is given as lectures, combined with tutorial groups for problem solving related to the course and a number of assignments intended to develop the skill of analyzing and designing algorithms.LiteratureInformation about literature is given on the course homepage before course start.Examination including compulsory elementsThe course is examined by an individual written hall-exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TIN093/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMA265",
    "course_name": "Numerical linear algebra",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameNumerisk linjär algebraCodeTMA265Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20143Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0101 Examination7.5 cGrading: TH7.5 c28 Okt 2025 pm J08 Jan 2026 pm JIn programmesMPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)ExaminerTo personal pageLarisa BeilinaFull Professor,Applied Mathematics and Statistics, Mathematical SciencesContactlarisa.beilina@chalmers.se+46 31 772 35 67To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic knowledge of numerical analysis and linear algebra.AimTo give the students knowledge and skill in using algorithms and numerical software for linear algebra problems.Learning outcomes (after completion of the course the student should be able to)- use numerical linear algebra as building bricks in computation\r\n- make a linear algebra model of a problem from the physical reallity\r\n- derive and use the numerical tecniques needed for a professional solution of a given linear algebra problem\r\n- use computer algorithms, programs and software packages to compute solutions to current problems\r\n- critically analyze anf give advice regarding different choices of models, algorithms, and software with respect to efficience and reliability\r\n- critically analyze the accuracy of the obtained numerical result and to present it in a visualized way.ContentNumerical linear algebra problems arise in many different fields of science like solid mechanics, electrical networks, signal analysis and optimisation. In this course we study basic linear algebra concepts like matrix algebra, vector- and matrix norms, error analysis and condition numbers. For solving linear systems of equations we consider Gaussian elimination with different pivoting strategies. For least-squares problems we study QR-factorisation and singular value decomposition. The metods for eigenvalue problems are based on transformation techniques for symmetric and nonsymmetric matrices.\r\nWe discuss the numerical algorithms with respect to computing time and memory requirements. By homework assignments and project work the students get experiences in implementation and evaluation of numerical algorithms for linear algebra problems.OrganisationLectures, supervising of hand-ins and computer exercisesLiteratureNumerical Linear Algebra: Theory and Applications, Larisa Beilina, Evgenii Karchevskii, and Mikhail Karchevskii, Springer 2016.Examination including compulsory elementsExperimental and homework assignments(hand-ins) and written examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMA265/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMA882",
    "course_name": "High performance computing",
    "description": "Course syllabus adopted 2024-02-05 by Head of Programme (or corresponding).Print pageOverviewSwedish nameHögprestandaberäkningCodeTMA882Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingUG - Pass, FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20134Maximum participants150(at least 10% of the seats are reserved for exchange students)Block scheduleB+Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0124 Examination7.5 cGrading: UG7.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory)MPPHS - Physics, Year 2(elective)ExaminerTo personal pageMartin RaumFull Professor,Algebra and Geometry, Mathematical SciencesContactraum@chalmers.se+46 31 772 35 22To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic courses in mathematics, numerical analysis,\nprogramming and data structures. Basic Matlab programming.AimOne aim of the course is to provide an insight into computer architecture and the effect it has on the performance of computer programs. The course also aims to provide the student with tools and techniques for code optimization and for parallel programming.Learning outcomes (after completion of the course the student should be able to)After completing the course the student will be able toorganize programming work on a remote computer using Linux command line toolswrite simple parallel programs using OpenMP, OpenCL, or MPIdescribe the basic features of CPUs and GPUsassess the influence of hardware and software on runtime performance.Show awareness and competence required to contribute to equality, equal treatment and diversity in society (EED).ContentShort introduction to C to the extent that is necessary for the computer labs.Linux command line tools.Parallel programming using threads, OpenMP, OpenCL, and MPI.Hardware architecture.Code optimization and compiler flags.Lectures and an assignment about equality, equal treatment and diversity (EED).OrganisationLectures and computer assignments. The assignments, which make up a substantial part of the course, consist of several short exercises which illustrate how performance is affected by the choice of computer architecture, programming language, data structures etc. The programs should be written in C. Please see the course homepage for more information.LiteratureLecture notes, manuals and articles.Examination including compulsory elementsThe examination consists of computer based assignments and an assignment about EED.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMA882/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE550",
    "course_name": "Stochastic processes and Bayesian inference",
    "description": "Course syllabus adopted 2021-02-12 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStokastiska processer och Bayesiansk inferensCodeMVE550Credits7.5 CreditsOwnerTKTEMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code59111Block scheduleBOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0118 Examination6 cGrading: TH6 c12 Jan 2026 am J10 Apr 2026 am J24 Aug 2026 am J0218 Written and oral assignments1.5 cGrading: UG1.5 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory)TKAUT - Automation and Mechatronics Engineering, Year 3(elective)TKITE - Software Engineering, Year 3(elective)TKTEM - Engineering Mathematics, Year 2(compulsory)ExaminerTo personal pagePetter MostadProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmostad@chalmers.se+46 31 772 35 79To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA basic course in mathematical statisticsAimBuilding on a first course in mathematical statistics, this course is meant to give knowledge about a larger inventory of stochastic models, in particular stochastic processes, and greater knowledge about Bayesian inference, in particular in the context of these models. Together, this knowledge should give a solid basis for practical application and prediction using stochastic processes in connection with data analysis, and for further studies in statistics and probability theory.Learning outcomes (after completion of the course the student should be able to)After completion of the course the student should be able to use certain basic stochastic processes as models for real phenomena, and adapt these models using observed data. The student should be able to make predictions from the models, both using theoretical properties and using computer based simulation. The student should be able to make computer based inference using MCMC for certain simple models, and in general understand and apply the Bayesian inferential paradigm.ContentDiscrete time Markov chains. Branching processes. Basic principles for Bayesian inference, using discretization and conjugate priors. Hidden Markov models (HMM). Monte Carlo integration and Markov chain Monte Carlo (MCMC) simulation. Poisson processes. Time-continuous Markov chains. Introduction to Brownian motion.OrganisationLectures and excercise classes. Obligatory assignments.LiteratureDobrow: Introduction to Stochastic Processes with R. (Available at Chalmers as e-book).Wiley 2016.Compendium. Lecture Notes.Examination including compulsory elementsWritten exam. Obligatory assignments.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "compulsory",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE550/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT450",
    "course_name": "Machine learning for natural language processing",
    "description": "Course syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameMaskininlärning för språkteknologiCodeDAT450Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studySoftware EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87123Maximum participants50Minimum participants10Block scheduleAOpen for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)ExaminerTo personal pageRichard JohanssonHead of Unit,Data Science and AI, Computer Science and EngineeringContactrichard.johansson@cse.gu.se+46 31 772 18 87To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThe course requires at least 7.5 credits of programming, 7.5 credits of probability theory or statistics, and a first course in machine learning, such as DAT340, TDA233, SSY340 or MVE440.AimThe course gives an introduction to machine learning models and architectures used in modern natural language processing (NLP) systems.Learning outcomes (after completion of the course the student should be able to)Knowledge and understanding:describe the most common types of natural language processing tasks,describe the most common types of machine learning models to address tasks in natural language processing,describe the technologies used to develop large language models,explain how text data can be annotated for a natural language processing task where machine learning techniques are used.Competence and skills:apply software libraries using machine learning  for common natural processing tasks,use and adapt pre-trained language models,write the code to implement machine learning models for natural language processing,use prompt-based large language models locally and via APIs,apply evaluation methods to assess the quality of natural language processing systems.Judgement and approach:discuss the advantages and limitations of different machine learning models with respect to a given task in natural language processing,reason about what type of data could be useful when training a model for a given natural language processing task,reason about strengths and weaknesses of prompt-based large language models in comparison to supervised techniques,select the appropriate evaluation methodology for a natural language processing system and motivate this choice,reason about ethical questions pertaining to machine learning based natural language processing systems, such as stereotypes and under-representation.ContentRapid developments in machine learning have revolutionized the field of NLP, including for commerically important applications such as translation, summarization, and information extraction. In particular, the last few years have seen the breakthrough of large language models, which enable new ways of developing NLP applications.However, natural language data exhibit a number of peculiarities that make them more challenging to work with than many other types of data commonly encountered in machine learning: natural language is discrete, structured, and highly ambiguous. It is extremely diverse: not only are there thousands of languages in the world, but in each language there is substantial variation in style and genre. Furthermore, many of the phenomena encountered in language follow long-tail statistical distributions, which makes the production of training data more costly. For these reasons, machine learning architectures for NLP applications tend to be quite different from those used in other fields.The course covers the following broad areas:Working practically with text data, including fundamental tasks such as tokenization and word counting;probabilistic models for text, such as topic models;overview of the most common types of NLP applications;architectures for representation in NLP models, including word embeddings, recurrent neural networks, and Transformers;machine learning models for common types of NLP problems, mainly categorization, sequence labeling, structured prediction and generation;use of prompt-based large language models via APIs and locally;pre-training and instruction-tuning of large language models;approaches to transfer learning in NLP.OrganisationClassroom teaching and computer labs where students get assistance with their assignments. Classroom activities usually follow an interactive flipped classroom format, but there are also occasional lectures.No activities with compulsory attendance.LiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsThe course is examined by mandatory written assignments submitted as written reports, as well as a self-defined project that requires the submission of a written report and an oral presentation. Some of the assignments will be carried out individually and others in groups of normally 2-4 students. The project is conducted by 2-4 students.A late submission of the assignments or project results in the grade Fail (U), unless special reasons exist. A failed assignment or project will be given the opportunity to submit a new solution on subsequent occasions the course is given.A passing grade for the entire course requires at least a passing grade for all assignments and the project.To be awarded a higher passing grade for the entire course, the student must, in addition, have a higher average on the weighted grades on the assignments and the project.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT450/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT570",
    "course_name": "Continuous optimization in data science",
    "description": "Course syllabus adopted 2023-02-02 by Head of Programme (or corresponding).Print pageOverviewSwedish nameKontinuerlig optimering inom datascienceCodeDAT570Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87118Maximum participants70(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0123 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)ExaminerTo personal pageAshkan PanahiDirector of Graduate Studies,Data Science and AI, Computer Science and EngineeringContactashkan.panahi@chalmers.se+46 31 772 11 90To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligable for the course the students shall have 7.5 credits from courses in programming in a general-purpose programming language orequivalent (preferably, but not limited to Python), and 7.5 credits mathematics or statistics.AimThe purpose of this course is to provide knowledge about the continuous optimization toolset for solving data science problems. After completing this course, the students are capable of formulating various data science problems as optimization problems and design a proper an approriate algorithm to solve them, considering computational complexity and statistical performance.Learning outcomes (after completion of the course the student should be able to)Knowledge and understanding:describe different types of optimization problems, such as continuous/discrete/mixed, convex/nonconvexexplain what types of data science problems can be addressed by optimization problemsexplain the main principles of different optimization algorithms and their global/local convergenceaccount for the computational complexity of optimization algorithms in data science, as well as their performanceSkills and abilities:implement various optimization algorithms as computer programs,apply and adapt optimization algorithms to data science problems, such as machine learning and rule-based approachesfind approximate solutions to computationally hard problemsformulate various problems in data science as mathematical optimization problemsJudgement ability and approach:reason about what type of information or features of the data could be useful in selecting optimization algorithmsselect the appropriate evaluation methodology including performance and convergence analysisContentThe course discusses the main aspects of optimization problems in data science, namely the concept of convergence and its relation to the statistical learning theory. The course presents different classifications of optimization problems such as convex/noncovex. The course also includes various challenges in data science by presenting real-world examples, and discusses main algorithmic ideas to address them.OrganisationLectures, exercise sessions, computer lab sessionsLiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsThe course is assessed through compulsory assignments.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT570/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "EEN020",
    "course_name": "Computer vision",
    "description": "Course syllabus adopted 2021-02-08 by Head of Programme (or corresponding).Print pageOverviewSwedish nameDatorseendeCodeEEN020Credits7.5 CreditsOwnerMPSYSEducation cycleSecond-cycleMain field of studyAutomation and Mechatronics Engineering, Computer Science and Engineering, Electrical EngineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code35112Maximum participants120(at least 10% of the seats are reserved for exchange students)Block scheduleCOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0118 Project3 cGrading: TH3 c0218 Written and oral assignments4.5 cGrading: TH4.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPHPC - High-performance Computer Systems, Year 2(elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)MPMED - Biomedical Engineering, MSc Progr, Year 1(compulsory elective)MPMED - Biomedical Engineering, MSc Progr, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 1(compulsory elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pageFredrik KahlHead of Unit,Signal Processing and Biomedical Engineering, Electrical EngineeringContactfredrik.kahl@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesGood knowledge in linear algebra, probability theory and programming. It is also desirable to have basic skills in image analysis, such as SSY097 - Image Analysis, but it is not required.AimThe course aims to provide an overview of theory and practical useful methods in computer vision, with applications such as seeing systems, non-destructive measurements and augmented reality. The aim is also to enable the student to develop his / her ability to solve problems, both with and without computer, using tools derived from many different sciences, especially geometry, optimization, statistics and computer science.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingFor a passing grade the student must:be able to clearly explain and use basic concepts in computer vision, in particular regarding projective geometry, camera modelling, stereo vision, and structure and motion problems.be able to describe and give an informal explanation of the mathematical theory behind some central algorithms in computer vision (the least squares method and Newton based optimization).Competence and skillsFor a passing grade the student must:in an engineering manner be able to use computer packages to independently solve problems in computer vision.be able to show good ability to independently identify problems which can be solved with methods from computer vision, and be able to choose an appropriate method.be able to independently apply basic methods in computer vision to problems which are relevant in industrial applications or research.with proper terminology, in a well-structured way and with clear logic, be able to explain the solution to a problem in computer vision.ContentProjective geometryGeometric transformationsModelling of camerasFeature extractionRobust estimationMinimal solvers in computer visionStereo vision3D-modellingRigid and non-rigid structure-from-motionBundle adjustmentGeometry of surfaces and their silhouettesOrganisationThe course consists of a number of lectures (including guest lectures given by industry and academic researchers). In addition there are a number of exercise sessions, laboratory sessions and one project. The project may be carried out individually or in pairs. The project involves the submission of a written report explaining the computer vision problem at hand, a motivation of the chosen theory and algorithms, results and conclusions.LiteratureLecture notes and research articlesOptional: Richard Szeliski, Computer Vision: Algorithms and Applications, available at Cremona or as afree pdf.Optional: Richard Hartley, Andrew Zisserman, Multiple View Geometry in Computer Vision, Cambridge University Press, 2004.Examination including compulsory elementsThere is no written exam in this course. The students will be evaluated on how well they perform in the different course activities, more specifically, the results of the home assignments and the project. To get the highest grade (5), it is necessary to pass an oral test.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "credits": 20.0,
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/EEN020/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE095",
    "course_name": "Options and mathematics",
    "description": "Course syllabus adopted 2023-02-14 by Head of Programme (or corresponding).Print pageOverviewSwedish nameOptioner och matematikCodeMVE095Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20125Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0106 Examination7.5 cGrading: TH7.5 c17 Jan 2026 am J10 Apr 2026 pm JIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)TKITE - Software Engineering, Year 3(elective)TKTEM - Engineering Mathematics, Year 3(elective)ExaminerTo personal pageMaria RoginskayaProfessor,Analysis and Probability Theory, Mathematical SciencesContactmaria.roginskaya@chalmers.se+46 31 772 35 70To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesOne variable calculus, linear algebra, probability theory/statistics.AimThe course deals with the options pricing theory within the binomial model and the Black-Scholes model.Learning outcomes (after completion of the course the student should be able to)(a) Describe financial derivatives of European, American and Asian type(b) Explain the concept of arbitrage(c) Describe algorithms for pricing and hedging financial derivatives in the binomial model(d) Compute numerically the price of American and European options in the binomial model(e) Derive the Black-Scholes model as limit of the binomial model(f) Compute the Black-Scholes price of European options(g) Use the Monte Carlo method to compute the Black-Scholes price of Asian options(h) Compute the Black-Scholes price of European options when the underlying stock pays a dividend(i) Derive the value of coupon bonds in the Vasicek interest rate modelContentThe Arbitrage-free Principle. Binomial model. Self-Financing Portfolios. Probability theory and Brownian Motion. Black-Scholes Model. Black-Scholes formula. Call and Put options. Exotic Options. Monte Carlo method. Dividends. Coupon bonds. Yield curveOrganisationThe course comprises approximately 50 lecture hours.LiteratureCalogero, S.: A first course in options pricing theory.Examination including compulsory elementsAssignments. Written examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE095/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE172",
    "course_name": "Basic stochastic processes and financial applications",
    "description": "Course syllabus adopted 2023-02-08 by Head of Programme (or corresponding).Print pageOverviewSwedish nameGrundläggande stokastiska processer och finansiella tillämpningarCodeMVE172Credits7.5 CreditsOwnerTKIEKEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code51121Open for exchange studentsYesOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Laboratory3 cGrading: UG3 c0220 Examination4.5 cGrading: TH4.5 c06 Dec 2025 am J08 Apr 2026 am J20 Aug 2026 am JIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)TKIEK - Industrial Engineering and Management - Financial mathematics, Year 3(compulsory)ExaminerTo personal pagePatrik AlbinAssociate Professor,Analysis and Probability Theory, Mathematical SciencesContactpalbin@chalmers.se+46 31 772 35 12To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesSannolikhetsteori motsvarande en första kurs i matematisk statistik. Någon erfarenhet av datoranvändning såsom exempelvis grunderna i Matlab-programmering eller liknande. Matematikkunskaper motsvarande vad som läres ut under första året på I-linjen.The equivalent of the course MVE095 Options and Mathematics.AimKursen syftar till att ge en introduktion till samt översikt av de klasser av stokastiska processer som är viktigast i såväl tekniska och naturvetenskapliga tillämpningar som i vidare matematisk och matematisk statistisk teoribyggnad.Learning outcomes (after completion of the course the student should be able to)narrate the theory for discrete time Markov chains and make applied calculations for themnarrate the meaning of dependence and independence between different stochastic process values/random variables and use this in applied calculationsnarrate the defining properties of weak/wide sense stationary processes redogöra för de grundläggande definierande egenskaperna för svagt stationära processer, Gaussian/normal processes and martingales and make applied calculations for themuse stochastic processes as models in mathematical finance, e.g., to calculate prices for financial contracts/optionsContentShort repetition/treatment of some important concepts from mathematics and multivariate probability theory. Discrete time and continuous time stochastic processes. Finite dimensional distribution functions. Mean and autocorrelation/aoutocovariance function. Stationary and weak/wide sense stationary processes. Processes with independent stationary increments/Levy processes. Gaussian/normal processes. Discrete time Markov chains. Martingales in discrete and continuous time. Continuity for and differentiation, integration and summation of stochastic processes. Basic queueing theory. Computer implementation of most of the mentioned classes of stochastic processes. Finacial applications.OrganisationLectures, exercise sessions and computer laborations.LiteratureHwei Hsu: Probability, Random Variables, and Random Processes, 2nd\r\nEdition. Schaum's Outlines, McGraw-Hill 2010. Lecture notes on financial applications.Examination including compulsory elementsWritten exam. Mandatory computer laboration and presentation.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE172/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE190",
    "course_name": "Statistical learning with regression models",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStatistisk inlärning med regressionsmodellerCodeMVE190Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20121Maximum participants100(at least 10% of the seats are reserved for exchange students)Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0108 Examination7.5 cGrading: TH7.5 c13 Jan 2026 pm J09 Apr 2026 pm JIn programmesMPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 2(elective)ExaminerTo personal pageUmberto PicchiniFull Professor,Applied Mathematics and Statistics, Mathematical SciencesContactpicchini@chalmers.se+46 31 772 64 14To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesMVE155 Statistical inference or a similar courseAimUnderstand the common mathematical structure of linear regression models and generalised linear models; construct and use these models for data analysis using statistical inference and suitable software; interpret the results and criticise the model limitations.Learning outcomes (after completion of the course the student should be able to)explain the common mathematical structure of linear regression models and generalized linear modelsconstruct and use these models for data analysis using statistical inference and suitable softwareinterpret the results and criticize the model limitationsidentify data analysis situations for which linear models apply naturally and to estimate and interpret parameterspredict future observations and test hypotheses using suitable software such as Rconstruct regression models that are suitable for the current data but can also generalize to future observationsexplain the model limitations, identify situations where the hypothesized model is not suitable for the given data, and possibly transform the data to increase the model predictive abilityContentsimple linear and multivariate linear models and underlying assumptionsthe bias/variance trade-ofproperties of least squares estimatorsidentification of outliers and the use of residuals and other diagnostics to verify if model assumptions are met;the use of categorical covariates in regression.testing parameters using the t-test;goodness of fit indices (R2and adjusted R2).confidence and prediction intervals.the multicollinearity problem, its identification and remedial measures.Model selection via greedy algorithms (stepwise procedures) and the AIC.Model selection via the partial F test;Prediction error and cross validation.Interaction between covariates.an introduction to generalised linear models, the exponential family, and asymptotic properties of the maximum likelihood estimators.testing procedures for generalised linear models.OrganisationLectures; weekly (or almost weekly) mini-projects and presentationsLiteratureUpdated on a yearly basis - please check course homepageExamination including compulsory elementsSummary report of the weekly mini-projects; a final project report; a written exam. Attendance to the weekly presentations of mini-analyses is mandatory. See the course page for how to compensate for missed attendance.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE190/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "SSY130",
    "course_name": "Applied signal processing",
    "description": "Course syllabus adopted 2023-02-02 by Head of Programme (or corresponding).Print pageOverviewSwedish nameTillämpad signalbehandlingCodeSSY130Credits7.5 CreditsOwnerMPICTEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Electrical Engineering, Biomedical engineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code90114Maximum participants200(at least 10% of the seats are reserved for exchange students)Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0107 Examination7.5 cGrading: TH7.5 c14 Jan 2026 pm J08 Apr 2026 pm J25 Aug 2026 pm JIn programmesMPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPEES - Embedded Electronic System Design, Year 1(compulsory elective)MPEES - Embedded Electronic System Design, Year 2(elective)MPEPO - Sustainable Electric Power Engineering and Electromobility, Year 2(elective)MPICT - Information and Communication Technology, Year 1(compulsory)MPMED - Biomedical Engineering, MSc Progr, Year 1(compulsory)MPMOB - Mobility Engineering, Year 1(elective)MPMOB - Mobility Engineering, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 1(compulsory elective)MPWPS - Wireless, Photonics and Space Engineering, Year 2(elective)ExaminerTo personal pageTomas McKelveyDeputy Head Of Department,Electrical EngineeringContacttomas.mckelvey@chalmers.se+46 31 772 80 61To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesWorking knowledge of linear algebra, probability theory and signals and systems (especially transforms, filtering, convolution, sampling theorem) is required. Knowledge of random processes is very useful, but not essential. Hence, the course  Random signals analysis is recommended. Experience of MATLAB is required.AimSignal processing involves techniques to recover important information from signals and to suppress irrelevant parts of those signals. The aim of this course is to provide the students with knowledge of standard techniques and applications in digital signal processing. These are relevant for the design and implementation of communication systems, control systems and other measurement systems such as biomedical instrumentation systems. The students are also given the opportunity to practically apply some of the techniques to semi-real signal processing problems and will be given insight into current practice in industry.Learning outcomes (after completion of the course the student should be able to)in both time-domain and frequency-domain analyse the effect of sampling, linear filtering and signal reconstructionexplain the relation between the Fourier transform, discrete Fourier transform and fast Fourier transform and apply the discrete Fourier transform to perform block based linear and circular filteringapply linear filter design techniques to construct FIR and IIR filters satisfying given specificationsapply LMS, RLS and Kalman filters to linear adaptive filtering problems and do simplified analysis regarding stability and rate of\r\nconvergenceapply multirate techniques to signal processing problems to increase the computational efficiencyexplain how quantization and finite word lengths affect the signal and algorithm quality and calculate the effect on the SNRdiscuss the effect of using a linear finite dimensional model as an approximation for an infinite dimensional linear systems.implementsignal processing algorithms on a DSP-systemContentReview of signal theory concepts: continuous-time and sampled signal representation in both time and Fourier domain, sampling, linear processing (filtering) and continuous-time signal reconstruction (D/A conversion)Review of random processes: mean values, autocorrelation function, spectrum, linear filtering of a white noise process.Filter design and realization: FIR and IIR filter structures, design methodologies, implementation details, matched filtersDiscrete Fourier transform: Finite data length, Fast Fourier transform (FFT), use of DFT for linear block-based filteringAdaptive filters: Least mean square (LMS), recursive least squares (RLS) and Kalman filteringMulti-rate signal processing: Uppsampling, downsampling, rate conversion, poly-phase representation, filter banksFinite word length effects: quantization of signal and filter coefficientsImplementation on DSP systemsOrganisationThe course is comprised of  15 lectures, 6 exercise sessions, 3 hand-in problems, 2 projects and a final written exam.LiteratureSee course homepage.Examination including compulsory elementsThe final grade is based on scores from projects and a written exam. The projects are mandatory in the sense that they must be passed to pass the course.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/SSY130/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "SSY316",
    "course_name": "Advanced probabilistic machine learning",
    "description": "Course syllabus adopted 2021-02-10 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAvancerad probabilistisk maskininlärningCodeSSY316Credits7.5 CreditsOwnerMPICTEducation cycleSecond-cycleMain field of studyElectrical EngineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code90118Block scheduleBOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Project7.5 cGrading: TH7.5 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 1(elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pageAlexandre Graell AmatFull Professor,Communication, Antennas and Optical Networks, Electrical EngineeringContactalexandre.graell@chalmers.se+46 31 772 17 53To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisites\u0003Working knowledge of probability and statistics and linear algebra.AimThis course delves into the connections between machine learning and probability theory and statistics. In particular, it will give a probabilistic viewpoint of machine learning problems. Probability theory can be applied to any problem involving uncertainty. In machine learning, uncertainty comes in many forms, e.g., the noise in the collected data, or uncertainty about the best prediction given some past data or in what is the best suited model to explain the data. The key idea behind the probabilistic framework to machine learning is that learning can be thought of as inferring plausible (probabilistic) models to describe data that one could observe from a system. Probabilistic models are able to make predictions and statements about observable data and are also capable to express the uncertainty of the predictions.The course will describe a wide variety of probabilistic models, suitable for a wide variety of data and tasks. It will also describe a wide variety of algorithms for inference and learning, when using such models. The goal is to present a unified view of machine learning through the lens of probabilistic modeling and inference.In the course the students will also learn universal models/methods that are useful in probabilistic machine learning, but also in other areas.Learning outcomes (after completion of the course the student should be able to)Explain the philosophy behind Bayesian inferenceDevelop an inference algorithm using the principles of Bayesian decision theory and a given cost functionUnderstand the connections between probability theory and machine learningExplain similarities and differences between probabilistic and classical machine learning methodsInterpret and explain results from probabilistic machine learningDerive, analyze, and implement the probabilistic methods introduced in the courseUnderstand how to apply several probabilistic models to data and determine the most suitable one for a given taskDiscuss and determine whether an engineering-relevant problem can be formulated as a supervised or unsupervised machine learning problemContentBayesian inference, probabilistic modeling of dataSupervised learning: Bayesian linear regressionBayesian graphical modelsMonte Carlo techniques: importance sampling, Gibbs sampling, Markov Chain Monte CarloMarkov random fields, factor graphsBelief propagation, variable eliminationHidden Markov modelsExpectation propagation and variational inferenceGaussian processesUnsupervised learningGenerative adversarial networks and variational autoencoders: two methods for unsupervised learning,Probabilistic deep learningOrganisationThe course comprises lectures, weekly home assignments and tutorial sessions related to the home assignments.LiteratureWe will mainly useChristopher M. Bishop, \"Pattern Recognition and Machine Learning\", Springer, 2006Examination including compulsory elementsThe final grade (TH) is based on scores from a project, quizzes, and a written exam. The project and the literature study are mandatory in the sense that they must be passed to pass the course.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/SSY316/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TDA251",
    "course_name": "Algorithms, advanced course",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAlgoritmer, fortsättningskursCodeTDA251Credits7.5 CreditsOwnerMPALGEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code02114Maximum participants85(at least 10% of the seats are reserved for exchange students)Block scheduleCOpen for exchange studentsYesOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0107 Project7.5 cGrading: TH7.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(compulsory elective)MPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPSOF - Software Engineering and Technology, Year 2(elective)MPSYS - Systems, Control and Mechatronics, Year 2(elective)ExaminerTo personal pagePeter DamaschkeFull Professor,Data Science and AI, Computer Science and EngineeringContactptr@chalmers.se+46 31 772 54 05To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThe course TIN093 Algorithms or equivalent is required.AimThe course provides advanced techniques in the design and analysis of algorithms. It continues in the spirit of the first Algorithms course and maintains a rigorous analytical style. The course goes deeper into specialized topics in algorithms. At some points it may even touch on frontiers of current research.Learning outcomes (after completion of the course the student should be able to)- know in more depth some important design and analysis techniques for algorithms, in particular, ways to approach NP-complete problems- to some extent be able to apply such techniques to solve new problems that may arise in various applications- have some practice in recognizing connections between algorithmic problems and reducing them to each other- be able to explain more complex algorithms and proofs in written form- know selected topics of current research on algorithmsContent- approximation algorithms and their analysis, approximation schemes,- use of linear programming, in particular for approximation,- network flow with some complex applications,- randomized algorithms and their analysis by appropriate random variables,- helpful input structures like tree structures and input parametersOrganisationLectures and hand-in exercises.LiteratureSee separate literature list.Examination including compulsory elementsExam, consisting of hand-in exercises and a final take-home exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TDA251/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TDA357",
    "course_name": "Databases",
    "description": "Course syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameDatabaserCodeTDA357Credits7.5 CreditsOwnerTKITEEducation cycleFirst-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1Course round 2EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code52143Maximum participants185Block scheduleD+Open for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0106 Examination4.5 cGrading: TH4.5 c14 Jan 2026 pm J27 Aug 2026 pm J0206 Laboratory3 cGrading: UG3 cIn programmesMPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)TIDAL - Computer Engineering, Year 2(compulsory)TKDAT - Computer Science and Engineering, Year 3(compulsory elective)TKIEK - Industrial Engineering and Management - Information technology, Year 3(compulsory)TKITE - Software Engineering, Year 2(elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pageJonas Almström DuregårdSenior Lecturer,Computing Science, Computer Science and EngineeringContactjonas.duregard@chalmers.se+46 31 772 10 28To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code52127Maximum participants165(at least 10% of the seats are reserved for exchange students)Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0106 Examination4.5 cGrading: TH4.5 c0206 Laboratory3 cGrading: UG3 cIn programmesMPDSC - Data Science and AI, Year 1(elective)MPMED - Biomedical Engineering, MSc Progr, Year 1(compulsory elective)TKAUT - Automation and Mechatronics Engineering, Year 3(elective)TKDAT - Computer Science and Engineering, Year 2(elective)TKDAT - Computer Science and Engineering, Year 3(compulsory elective)TKITE - Software Engineering, Year 2(elective)TKITE - Software Engineering, Year 3(elective)TKTEM - Engineering Mathematics, Year 3(compulsory elective)ExaminerTo personal pageAna BoveHead of Unit,Computing Science, Computer Science and EngineeringContactbove@chalmers.se+46 31 772 10 20To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for bachelor's level (first cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsThe same as for the programme that owns the course.Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible for the course the student should have successfully completed university level courses of at least 45 credits, including:at least 15 credits in programming, e.g., TDA548, TDA553, TDA367, or equivalent,at least 7.5 credits in mathematics or mathematic reasoning,concepts in logic, sets, functions and relations that could be acquired with, e.g., TMV200AimDatabases are a ubiquitous feature of the information technology society, and most people have come in contact with them, either directly while using the world wide web, or indirectly through banks, the tax office, etc. A course on database systems is therefore essential to a well-rounded education in computer science.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able to:Knowledge and understandingexplain the semantic meaning of queries using relational algebra.Competence and skillsconstruct an Entity-Relationship diagram for a given domain;translate an Entity-Relationship diagram into a relational database schema;apply design theory concepts for relational databases such as functional dependencies and normalization;design a database interface using constraints, views and triggers;implement a relational database schema and related interface using a data definition language;retrieve and modify data using a database language for respective task;use a semi-structured data model;communicate with a database, through a database interface, from a software application.Judgement and approachevaluate and create different models for a database domain using Entity-Relationship diagrams and relational schemas;contrast the relational and the semi-structured data models.ContentThe course covers the basic principles of database systems as seen by users, application programmers and database administrators. A laboratory assignment develops these topics as a running example throughout the course. These include programming in SQL, as seen by a user querying or modifying an existing database, by a database designer, and by an application programmer invoking SQL from a host language.Course contents include:entity-relationship modeling;functional dependencies and normalisation;database querying and manipulation through SQL;interfacing to a database from a host language (such as Java/JDBC);overview of document-based data format such as XML and JSON;introduction to relational algebra.OrganisationThe course consists of weekly lectures and exercise sessions, as well as supervised lab sessions.LiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsWritten individual exam given in an examination hall and programming assignments. The programming assignments are normally carried out in pairs.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TDA357/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TDA507",
    "course_name": "Computational methods in bioinformatics",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameBeräkningsmetoder inom bioinformatikCodeTDA507Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyBioengineering, Computer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87130Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0113 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 2(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPHPC - High-performance Computer Systems, Year 2(elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pageGraham KempProfessor,Data Science and AI, Computer Science and EngineeringContactkemp@chalmers.se+46 31 772 54 11To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible for the course the student should have successfully completed 90 hec of studies within the subject Computer Science or equivalent. Furthermore, the student should have successfully completed a course in Programming and in Discrete Mathematics.AimThis course demonstrates how computational methods that have possibly been presented in other computing courses can be applied to solve problems in an application area.We look at problems related to the analysis of biological sequence data (sequence bioinformatics) and macromolecular structures (structural bioinformatics). Computing scientists need to be able to understand problems that originate in areas that may be unfamiliar to them, and to identify computational methods and approaches that can be used to solve them. Biological concepts needed to understand the problems will be introduced.This is an advanced level course which uses research articles as the main reference materials. Reading research articles is valuable training for scientists and researchers.These demonstrate how to present ideas and methods, and how to critically evaluate them. Developing skill in reading research articles is useful preparation for future scientific investigations, and one's own scientific writing can improve through reading.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingdescribe and summarise problems that have been addressed in the bioinformatics literature, and computational approaches to solving themCompetence and skillsdesign and implement computational solutions to problems in bioinformaticsJudgement and approachcritically discuss different bioinformatics methods that address the same task or related tasks, and to discuss differences in the tasks addressed, or differences in the computational approachesidentify situations where the same computational methods are applied in addressing different problems, even across different application areasContentComputational methods and concepts featured in this course include: dynamic programming; heuristic algorithms; graph partitioning; image skeletonisation, smoothing and edge detection; clustering; sub-matrix matching; geometric hashing; constraint logic programming; Monte Carlo optimisation; simulated annealing; self-avoiding walks.Biological problems featured in this course include: sequence alignment; domain assignment; structure comparison; comparative modelling; protein folding; fold recognition; finding channels; molecular docking; protein design.OrganisationLectures and programming assignments.LiteratureLecture handouts; web-based resources; selected research articles.Examination including compulsory elementsThe course is examined by individual programming assignments and written assignments.The grading scale comprises 3, 4, 5 and Fail (U).The lowest pass grade reflects fulfilment of the learning outcomes demonstrated by satisfactory completion of the assignments. A higher grade requires a greater levelof understanding, insight and reflection.To pass the course, the assignments must pass. To get a higher grade, a higher weighted average from the grades of the assignments is required.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TDA507/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TDA596",
    "course_name": "Distributed systems",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2025-02-20 by Head of Programme (or corresponding).Print pageOverviewSwedish nameDistribuerade systemCodeTDA596Credits7.5 CreditsOwnerMPCSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code42122Block scheduleCOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0107 Examination6 cGrading: TH6 c13 Jan 2026 am JDIG09 Apr 2026 pm JDIG19 Aug 2026 pm JDIG0207 Laboratory1.5 cGrading: UG1.5 cIn programmesMPCSC - Computer Systems and Cybersecurity, Year 1(compulsory)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPHPC - High-performance Computer Systems, Year 2(elective)MPSOF - Software Engineering and Technology, Year 2(elective)TIDAL - Computer Engineering - Common branch of study, Year 3(compulsory elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pageRomaric DuvignauHead of Unit,Computer and Network Systems, Computer Science and EngineeringContactduvignau@chalmers.se+46 31 772 69 76To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThis course has the same prerequisites as the Master Program in Computer Systems and Networks. Thus, a student should have taken a course in computer communication or computer networks (or equivalent) including the TCP/IP protocol stack and have programming experience. In addition, a course in operating systems or concurrent programming (or equivalent) is required.AimWhy are computing systems becoming increasingly distributed? How can we build reliable and fault-tolerant distributed systems? Why does the Internet scale to billions of users? How are modern distributed systems such as the cloud, the smart grid, or connected cars built? These are a few questions that our course on distributed systems addresses. The goal of the courses is to understand the design of distributed systems and discuss the underlying principles and mechanisms that drive today's distributed systems. Our lectures provide you with the required fundamentals, and our labs give you a hands-on experience in developing distributed systems and exploring their real-world challenges.Learning outcomes (after completion of the course the student should be able to)1. Knowledge and understandingRecall and apply knowledge of basic concepts of distributed systems and their challenges, naming and synchronization of systems, consistency and replication, and fault tolerance in distributed systems.Describe applications of distributed systems and the mechanisms these use to provide their services.Discuss and analyze the challenges and requirements that the different approaches have.Compare and summarize the strengths and weaknesses associated with the individual mechanisms.2. Skills and abilitiesDevelop and evaluate small-scale distributed systems using fundamental mechanisms introduced in the lectures.Showcase the ability to independently acquire the necessary knowledge and adeptly collaborate with peers to design and develop small-scale distributed systems.Demonstrate software developments in advanced settings including unreliable links and systems as well as limited bandwidth.Demonstrate lab results in oral and written presentation.3. Judgment and approachDescribe and analyze existing and new methods for distributed systems design. In particular, the systems' ability for scalability and fault tolerance.Discuss and value the social and ethical aspects of distributed systems and their applications.ContentWe begin the course with an introduction to the basic concepts of distributed systems and the challenges they pose. After that, we revisit the required background in communication systems and operating systems. We continue with the main course content and focus on:NamingMutual Exclusion and ElectionClocks and TimeConsistency and ReplicationFault Tolerance in Distributed SystemsSelected Applications in Distributed SystemsOur lectures provide students with the required fundamentals, and labs give students a hands-on experience in developing distributed systems and exploring their real-world challenges. This course offers learning experiences that involve hands-on experimentation and analysis as they reinforce student understanding of concepts and their application to real-world problems. Overall, in this course students develop an understanding of fundamental issues in the design of methods for distributed systems.OrganisationLectures and laboratory assignments.LiteratureAndrew S. Tanenbaum, Marten van Steen, \"Distributed Systems - Principles and Paradigms\", PearsonExamination including compulsory elementsIn order to be approved for the course, the compulsory laboratory part must be approved and a required total number of points must be reached (adding points from the laboratory work and a written exam). Based on the final number of points obtained, grades U, 3, 4 or 5 are given.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to module:2025-04-04:Digital examChanged to digital exambyExam.[0107 Examination 6,0 credit] Changed to digital examination inspera",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TDA596/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TEK656",
    "course_name": "Creating technology-based ventures",
    "description": "Course syllabus adopted 2024-05-22 by Head of Programme (or corresponding).Print pageOverviewSwedish nameTeknikbaserat entreprenörskapCodeTEK656Credits7.5 CreditsOwnerTKIEKEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Industrial Engineering and ManagementDepartmentTECHNOLOGY MANAGEMENT AND ECONOMICSGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code86116Maximum participants20(at least 10% of the seats are reserved for exchange students)Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0121 Examination7.5 cGrading: TH7.5 c15 Jan 2026 am JDIG08 Apr 2026 am JDIG24 Aug 2026 pm JDIGIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPALG - Computer Science - Algorithms, Languages and Logic, Year 2(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPCSN - Computer Systems and Networks, Year 2(elective)MPDSC - Data Science and AI, Year 1(elective)MPDSC - Data Science and AI, Year 2(elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPHPC - High-performance Computer Systems, Year 2(elective)ExaminerTo personal pageHenrik BerglundProfessor,Entrepreneurship and Strategy, Technology Management and EconomicsContacthenrik.berglund@chalmers.se+46 31 772 44 28To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.AimThis course deals with the creation of technology-based ventures. Special emphasis is placed on theories and pragmatic methods tailored to the earliest stage in a startups life. This stage is characterized by great uncertainty regarding issues such as: what you as an entrepreneur want to do, who your customers are, what problems they have, what your product and value proposition should be, how you will acquire customers, how you will distribute your product to those customers, and how you will make money. Besides providing theoretical understanding of how to analyze and think about such questions, a major ambition of this course is to expose students to useful tools and tactics that will help transform an idea or technology into a validated business model.Learning outcomes (after completion of the course the student should be able to)After completing the course, students will:Be familiar with modern startup theories.Know the value and limits of business planning.Know the difference between a startup and a company.Know how to elicit valuable feedback through customer interviews.Know how to work with experiments and prototypes to speed up learning.Know how to engage other stakeholders in co-creation processes.Know how to work with metrics and key process indicators in startups.Know how to manage the transition from early adopters to mainstream users.Be familiar with sources of venture finance.Be familiar with issues related to gender and diversity in the context ofentrepreneurship.Have learned about a range of specific tools and methods for efficiently identifying andtesting business model assumptions.Have improved their presentation skills.Know what startup support is available at Chalmers.Potentially have kick-started their entrepreneurial career.ContentThe course covers a range of issues central to the successful creation of new business. These can be organized into three broad phases, with emphasis being on the second:Identifying: identifying business ideas, analyzing markets, structuring business models.Designing: experimental testing of business hypotheses, transformational co-creating withothers.Scaling: entering mainstream markets, metrics and growth, venture finance.OrganisationThe course is based on readings, lectures, guest lectures, and videos that cover theories, methods, and practical tools for identifying, developing, and scaling new business. The projects, which make up an essential part of the course, will further help students understand and apply theories, methods, and tools in a real-life setting.LiteratureSee the course homepageExamination including compulsory elementsGrading is done on the basis of quizzes, written exams, and project work. All these parts contribute points out of which the final grade is calculated but students must get a passing grade on the final exam to pass the course.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "prerequisites": [
      "TEK655",
      "TEK656"
    ],
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TEK656/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMA522",
    "course_name": "Large scale optimization",
    "description": "Course syllabus adopted 2023-02-14 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStorskalig optimeringCodeTMA522Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20131Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Examination, part A 6 cGrading: TH6 c16 Jan 2026 pm J08 Apr 2026 pm J0222 Project, part B 1.5 cGrading: UG1.5 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 2(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)TKITE - Software Engineering, Year 2(elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pageAnn-Brith StrömbergFull Professor,Applied Mathematics and Statistics, Mathematical SciencesContactanstr@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic courses on linear and integer optimization as well as nonlinear optimization.AimThe purpose of the course is to provide the students with an overview of the most important principles for the efficient solution of practical large-scale optimization problems, from modelling to method implementation. The course comprises a series of lectures covering theory and methodology, modelling exercises in smaller groups, and project assignments in which the students apply the knowledge gained to efficiently solve some relevant optimization problems.Learning outcomes (after completion of the course the student should be able to)independently analyze and suggest modelling and solution principles for large-scale complex optimization problems;have sufficient knowledge to use these principles successfully in practice through the use of computation software for optimization problems.ContentLarge-scale optimization problems often possess some inherent structures that can be exploited in order to solve such problems efficiently. The course deals with a number of such principles through which large-scale optimization problems can be attacked. A common term for such techniques is decompositioncoordination (or, distributed algorithmconsensus); convexity and duality theory underlie its development. The course includes practical moments: exercises in the modelling and solution of optimization problems with complicating constraints and/or variables, and project assignments in which large-scale optimization problems are to be solved through the use of duality theory and techniques presented during the lectures.Contents in brief: complexity, simple/difficult optimization problems, integer linear optimization problems, unimodularity, convexity. Decompositioncoordination, restriction, relaxation, bounds on the optimal value, projection, variable fixing, dualization, neighbourhoods, heuristics, local search methods. Lagrangean duality, subgradient methods, (ergodic) convergence, recovery of integer solutions, Lagrangean heuristics, cutting planes, column generation, coordinating master problem, DantzigWolfe decomposition, Benders decomposition.OrganisationLectures. Modelling exercises including oral presentations and discussions. Project assignments including oral and written presentations as well as oppositions. Advisement. Mandatory presence at workshops. Additionally, there might be voluntary elements that could give bonus points for the written exam.LiteratureSee the course home page.Examination including compulsory elementsWritten reports and oral presentations of the projects, which may also give bonus points on the exam; opposition/peer review; presence and active participation at workshops; a written exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMA522/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT410",
    "course_name": "Design of AI systems",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameDesign av AI-systemCodeDAT410Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87122Maximum participants160(at least 10% of the seats are reserved for exchange students)Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0119 Written and oral assignments7.5 cGrading: TH7.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPDSC - Data Science and AI, Year 1(compulsory)MPHPC - High-performance Computer Systems, Year 1(elective)ExaminerTo personal pageAshkan PanahiDirector of Graduate Studies,Data Science and AI, Computer Science and EngineeringContactashkan.panahi@chalmers.se+46 31 772 11 90To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA course in programming in a general-purpose language (e.g. C/C++/Java/Python or similar). One course in mathematics (e.g. calculus, linear algebra, applied mathematical thinking), and one course in mathematical statistics. The course \"Introduction to Data Science and AI\" (DAT405) or similar. We strongly recommend that the student has taken a course in Machine learning, for example DAT340, TDA233 or similar, or that such a course is taken in parallel alongside this course.AimThe purpose of the course is to explain how some different well-known AI-systems work, provide insight in how such systems are built, and practice to develop such systems. The course takes a broad perspective and includes related areas such as data science, algorithms and optimization as appropriate.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able to:Knowledge and understandingProvide an overview of different applications of AI and related areas.Describe how some different well-known AI-systems work and how they are used.Explain how AI approaches relate to other kinds of advanced information processing.Skills and abilitiesIdentify problems that can be solved with AI and other advanced computational techniques.Design simpler Ai systems for different applications, including model choices and system design.Implement AI systems with programming in combination with different tools and programming libraries.Judgement and approachDiscuss advantages and disadvantages of different models and approaches in AI.Reflect over fundamental possibilities and limitations of current AI approaches.Critically analyze and discuss AI applications with respect to ethics, privacy and societal impact.Show a reflective attitude in all learning.ContentThe course teaches design of AI systems in several different ways:Reading of papers and lectures describing different AI systems and their design (eg. AlphaZero, Watson, systems for self-driving cars,)Opportunities to see and try out the implementation of different simpler AI systems.Own problem solving in the form of design and implementation of simpler AI systems.Discussions about possibilities and limitations of AI, ethics and societal impact.OrganisationLectures and modules with exercises and mini-projects  these are mainly done in groups to two persons.LiteratureReading in the form of papers etc. , to be presented as the course proceeds.Examination including compulsory elementsAssignments and mini-projects. No exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "compulsory",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT410/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT341",
    "course_name": "Applied machine learning",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameTillämpad maskininlärningCodeDAT341Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1Course round 2EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code87128Maximum participants125Block scheduleBOpen for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Take-home examination4 cGrading: TH4 c0222 Written and oral assignments3.5 cGrading: TH3.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPEPO - Sustainable Electric Power Engineering and Electromobility, Year 1(elective)MPHPC - High-performance Computer Systems, Year 1(compulsory elective)TIDAL - Computer Engineering - AI - Machine learning , Year 3(compulsory)TKGBS - Global Systems Engineering, Year 3(compulsory elective)ExaminerTo personal pageSelpi SelpiHead of Division,Data Science and AI, Computer Science and EngineeringContactselpi@chalmers.se+46 31 772 13 69To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code87114Maximum participants125(at least 10% of the seats are reserved for exchange students)Block scheduleCOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Take-home examination4 cGrading: TH4 c0222 Written and oral assignments3.5 cGrading: TH3.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPEPO - Sustainable Electric Power Engineering and Electromobility, Year 1(elective)MPHPC - High-performance Computer Systems, Year 1(compulsory elective)MPSOF - Software Engineering and Technology, Year 1(compulsory elective)TKDAT - Computer Science and Engineering, Year 3(elective)TKITE - Software Engineering, Year 3(elective)ExaminerTo personal pageSelpi SelpiHead of Division,Data Science and AI, Computer Science and EngineeringContactselpi@chalmers.se+46 31 772 13 69To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA course in programming in a general-purpose language (e.g. C/C++/Java/Python or similar). One course in mathematics (e.g. calculus, linear algebra, applied mathematical thinking), and one course in mathematical statistics. The course \"Introduction to Data Science and AI\" (DAT405, DAT565) or similar. The course DAT341 cannot be included in a degree which contains (or is based on another degree which contains) the course TDA233.AimThe course gives an introduction to machine learning techniques and theory, with a focus on its use in practical applications.Learning outcomes (after completion of the course the student should be able to)On successful completion of the course the student will be able to:Knowledge and understandingdescribe the most common types of machine learning problems,explain what types of problems can be addressed by machine learning, and the limitations of machine learningaccount for why it is important to have informative data and features for the success of machine learning systems,explain on a high level how different machine learning models generalize from training examples.Skills and abilitiesapply a machine learning toolkit in an application relevant to the data science area,write the code to implement some machine learning algorithms,apply evaluation methods to assess the quality of a machine learning system, and compare different machine learning systems.Judgement and approachdiscuss the advantages and limitations of different machine learning models with respect to a given task,reason about what type of information or features could be useful in a machine learning task,select the appropriate evaluation methodology for a machine learning system and motivate this choice,reason about ethical questions pertaining to machine learning systems.ContentDuring the course, a selection of topics will be covered in supervised learning, such as linear models for regression and classification, or nonlinear models such as neural networks, and in unsupervised learning such as clustering.The use cases and limitations of these algorithms will be discussed, and their implementation will be investigated in programming assignments. Methodological questions pertaining to the evaluation of machine learning systems will also be  discussed, as well as some of the ethical questions that can arise when applying machine learning technologies.There will be a strong emphasis on the real-world context in which machine learning systems are used. The use of machine learning components in practical applications will be exemplified, and realistic scenarios will be studied in application areas such as ecommerce,business intelligence, natural language processing, image processing, and bioinformatics. The importance of the design and selection of features, and their reliability, will be discussed.OrganisationLectures, exercise sessions, computer lab sessions.LiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsThe course is examined by an individual written take-home exam, as well as mandatory written assignments submitted as written reports, some of which will be carried out individually and others in groups of normally 2-4 students.A late submission of the take-home examination results in the grade Fail (U), unless special reasons exist. A failed take-home examination is reexamined by a new take-home examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to course rounds:2025-10-14:ExaminatorExaminatorchangedfromRichard Johansson (richajo)toSelpi Selpi (selpi)byViceprefekt/adm[Course round 1]",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT341/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT675",
    "course_name": "Artificial intelligence for molecules",
    "description": "The course syllabus contains changesSee changesCourse syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameArtificiell intelligens för molekylerCodeDAT675Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studySoftware EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsThe course syllabus contains changesCourse round 1Teaching languageEnglishApplication code87140Maximum participants50(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0125 Written and oral assignments3 cGrading: TH3 c0225 Project4.5 cGrading: TH4.5 cIn programmesMPAEM - Materials Engineering, Year 1(elective)MPCAS - Complex Adaptive Systems, Year 1(elective)MPDSC - Data Science and AI, Year 1(elective)ExaminerTo personal pageRocio MercadoAssistant Professor,Data Science and AI, Computer Science and EngineeringContactrocio.mercado@chalmers.se+46 31 772 14 93To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo enroll in the course, students should have completed and passed the following:DAT565 Introduction to Data Science and AI or equivalentAt least one other formal programming courseAimThis course provides a comprehensive introduction to the transformative role of AI in molecular sciences. Structured into four modules, it covers molecular representations, property prediction, and generative AI techniques, culminating in a hands-on project tackling real-world challenges.Emphasizing practical skills, the course integrates programming, machine learning frameworks, and data handling best practices. Designed for students with a solid programming foundation, it bridges diverse scientific backgrounds to explore the intersection of AI and molecular science.Learning outcomes (after completion of the course the student should be able to)Knowledge and UnderstandingOn successful completion of the course, students will be able to:1. Articulate the role of molecular data in addressing global challenges such as healthcare innovation, sustainability, and biotechnology, and explain its distinct importance compared to other areas of data science.2. Describe the foundations of cheminformatics and the evolution of AI methods for molecular applications, highlighting historical milestones and technological advancements.3. Explain the principles of molecular data representation and analysis, including key challenges, pitfalls, and best practices when working with this specialized data.4. Demonstrate knowledge of state-of-the-art AI methods for molecular property prediction and molecular generation, including their strengths, limitations, and potential for industry applications.5. Critically evaluate AI models in the context of molecular science, considering data quality, biases, and the broader implications of model design and performance.Skills and AbilitiesOn successful completion of the course, students will be able to:1. Preprocess, analyze, and manage molecular datasets, ensuring data quality and addressing common challenges such as data imbalance and representation biases.2. Design and implement machine learning pipelines tailored to molecular property prediction and generative tasks, considering real-world constraints such as missing data, data sparsity, computational resources, and model complexity.3. Apply advanced techniques in optimization, statistics, and algorithm development to molecular AI tasks and analyze the results in a meaningful and reproducible manner.4. Use modern programming tools and libraries (e.g., PyTorch, RDKit, scikit-learn, HuggingFace) to develop scalable and efficient molecular AI workflows, while adapting to emerging technologies in the field.5. Communicate findings, insights, and implications of molecular AI research effectively to interdisciplinary audiences, fostering collaboration across fields.Judgement and ApproachOn successful completion of the course, students will be able to:1. Critically assess molecular AI models for reliability, reproducibility, scalability, and applicability to real-world problems across industries.2. Reflect on the ethical, societal, and environmental implications of AI-driven solutions in molecular sciences, contributing to the responsible development and application of these technologies.3. Evaluate the strategic potential of integrating molecular AI in solving future global challenges, identifying opportunities for innovation and cross-disciplinary collaboration.4. Foster a mindset of continuous learning and critical inquiry, recognizing the evolving nature of AI technologies and their applications in molecular sciences.ContentThis course explores the transformative role of artificial intelligence (AI) in molecular sciences, offering students a comprehensive introduction to the principles, methods, and applications of AI for molecules.The course is structured into four modules, beginning with an introduction to the field and machine representations of molecules (Module 1). Building on this foundation, the course then delves into molecular property prediction using machine learning (Module 2), focusing on best practices for data preparation and constructing predictive models. In Module 3, students explore generative AI techniques for designing novel molecules, equipping them with skills in molecular engineering. Finally, the course culminates in a hands-on project (Module 4), where students apply their knowledge to tackle a real-world challenge in molecular engineering.The course emphasizes practical skills development, integrating programming, cheminformatics, machine learning frameworks, and good data handling practices. It is designed for students from diverse scientific backgrounds who already have a solid foundation in programming and would like to learn more about methods at the intersection of AI and molecular science.OrganisationThe course consists of 16 lectures (two 90-min lectures per week), 2 lab sessions per week, and a final project. The following components of the course are compulsory:2 assignmentsProject proposalFinal project reportFinal presentationLiteratureThe course uses open-source resources (free e-book, blogs, and scientific articles) as part of the course literature.Examination including compulsory elementsThe grading scale (5, 4, 3) comprises:2 assignments (5 points each)Project proposal (5 points)Final project report (5 points)Final presentation (5 points)The grades will be determined according to the following scale:5: 24-25 points (out of 25)4: 21-23 points3: 17-20 pointsU: <17 pointsThe course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.The course syllabus contains changesChanges to course rounds:2025-05-05:BlockBlockchangedfromDtoAbyUBS[Course round 1]",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT675/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "EEN210",
    "course_name": "Applied digital health",
    "description": "Course syllabus adopted 2023-02-27 by Head of Programme (or corresponding).Print pageOverviewSwedish nameTillämpad digital hälsaCodeEEN210Credits7.5 CreditsOwnerMPMEDEducation cycleSecond-cycleMain field of studyBiomedical engineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code41115Maximum participants80(at least 10% of the seats are reserved for exchange students)Block scheduleC+Open for exchange studentsYesOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0123 Project5 cGrading: TH5 c0223 Oral examination2.5 cGrading: UG2.5 cIn programmesMPDSC - Data Science and AI, Year 1(elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPMED - Biomedical Engineering, MSc Progr, Year 1(compulsory elective)ExaminerTo personal pageStefan CandefjordProgramansvarig,Electric, Computer, IT and Industrial EngineeringContactstefan.candefjord@chalmers.se+46 31 772 15 49To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThe courses EEN070 - Introduction to biomedical engineering, TDA357 - Databases, or equivalent knowledge, are recommended. Basic knowledge in programming.AimThe overall aim of the course is to provide healthcare providers and healthcare related industry with people having skills and prerequisites to design and implement Digital Health solutions, inside as well as outside the hospital environment. A specific purpose is to train the ability to design an effective system based on international standards for healthcare data exchange for a specific health issue, that meets the requirements of patients, caregivers and authorities.Learning outcomes (after completion of the course the student should be able to)Describe the state-of-the-art, possibilities and challenges of Digital Health systems, and its impact on the society as a whole.Apply the concept of data fusion for increased effectiveness of Computerized Clinical Decision Support Systems (CCDSS)Describe the importance of ethical considerations, legislation and patient integrity when designing and implementing Digital Health solutions.Implement some existing international standards applicable to Digital Health in a CCDSS solution, and explain the needs for standardization and interfacing between various systems.Design a CCDSS for a relevant health issue and identify the procedures and challenges of implementing such a system in a healthcare environment. The CCDSS should be demonstrated and described in a technical report.ContentThe course contains of a lecture series with invited expert speakers from industry, academia and other healthcare related stakeholders, and a project work, which together cover the following topics:State-of-the-art technologies for digital health, examples of commercially available devices and a future outlook on emerging technologiesInteroperability and standards for exchanging, analyzing and interpretating healthcare data, an overview of widespread and recommended technologiesDesign of CCDSS toolsHealthcare organization, legislation, clinical, patient and ethical perspectivesData fusion - how data of different types from different sensors can be combined to design more effective servicesOrganisationThe responsible department is the Department of Electrical Engineering.\nThe teaching is given in the form of lectures as well as lessons / demonstrations / laboratory work / seminars in small groups. A project work is carried out to design a CCDSS. More detailed information will be given on the course website before the start of the course.LiteratureLecture notes, hand-outs/distributed material and recommended articles, reports and other sources.Examination including compulsory elementsExamination of the lecture series is done through an oral exam. The project work is assessed based on the demonstration of the CCDSS and the written technical report. To pass the course passing the oral exam and approved group project are required.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/EEN210/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TDA233",
    "course_name": "Algorithms for machine learning and inference",
    "description": "Course syllabus adopted 2023-02-04 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAlgoritmer för maskininlärning och slutledningCodeTDA233Credits7.5 CreditsOwnerMPALGEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code02118Maximum participants120Block scheduleBOpen for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Written and oral assignments3 cGrading: TH3 c0220 Examination4.5 cGrading: TH4.5 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(compulsory elective)MPCAS - Complex Adaptive Systems, Year 1(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 1(elective)MPHPC - High-performance Computer Systems, Year 1(elective)MPSYS - Systems, Control and Mechatronics, Year 1(elective)ExaminerTo personal pageMorteza Haghir ChehreghaniProfessor,Data Science and AI, Computer Science and EngineeringContactmorteza.chehreghani@chalmers.se+46 31 772 64 15To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible to the course, the student should have a bachelor degree.In particular, the student must have acquired the following knowledge:- 7.5 credits of programming- 7.5 credits of data structures- 7.5 credits of basic probability and statistics- 7.5 credits of linear algebra- 7.5 credits of multivariate calculus.The course TDA233 cannot be included in a degree which contains (or is based on another degree which contains) the course DAT340/DAT341.AimThis course will discuss the theory and application of basic algorithms for machine learning and inference, from an AI perspective. In this context, we consider learning to draw conclusions from given data or experience which results in some model that generalizes these data. Inference is to compute the desired answers or actions based on the model.Algorithms of this kind are commonly used in for example classification tasks (character recognition, or to predict if a new customer is creditworthy, etc.) and in expert systems (for example for medical diagnosis). A new and commercially important area of application is data mining, where the algorithms are used to automatically detect interesting information and relations in large commercial or scientific databases.The course intends to give a good understanding of this cross-disciplinary area, with sufficient depth to use and evaluate the available methods and to understand the scientific literature.Learning outcomes (after completion of the course the student should be able to)Knowledge and understanding:explain a representative set of available methods for machine learningCompetence and skills:implement and analyze machine learning algorithmsapply sound mathematical principles to the inference of hypotheses from empirical data and models on scientific groundsJudgement and approach:choose appropriate methods and apply them to specific inference problems, based on a solid understanding of scientific literature in the fieldevaluate the methods qualitatively and quantitatively, and recognize their strengths as well as their limitationsContentThe following concepts are covered:Supervised Learning: Bayes classifier, Perceptron, Support vector machines, K-nearest neighbor models, Regression, logistic regression;Maximum likelihood estimation and Bayesian methods;Unsupervised Learning: Clustering algorithms, EM algorithm, Mixture models, Model selection, Kernel methods;Deep Learning models such as fully connected neural networks, Convolutional Neural Networks, Recurrent Neural Networks.OrganisationLectures and homework assignments.LiteratureSee course homepage.Examination including compulsory elementsThe course is examined by assignments and a written hall examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TDA233/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TIF150",
    "course_name": "Information theory for complex systems",
    "description": "Course syllabus adopted 2025-02-20 by Head of Programme (or corresponding).Print pageOverviewSwedish nameInformationsteori för komplexa systemCodeTIF150Credits7.5 CreditsOwnerMPCASEducation cycleSecond-cycleMain field of studyBioengineering, Chemical Engineering, Engineering PhysicsDepartmentSPACE, EARTH AND ENVIRONMENTGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code11116Block scheduleB+Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0107 Examination7.5 cGrading: TH7.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(elective)ExaminerTo personal pageClaes AnderssonSenior Researcher,Physical Resource Theory, Space, Earth and EnvironmentContactclaeand@chalmers.se+46 31 772 31 27To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesBasic undergraduate mathematics and probability theory.AimThe course introduces the students to important concepts in information theory that can be used to describe and characterise complex systems. The concepts are applied to a number of areas in complex systems: cellular automata, fractals, chemical self-organisation, and chaos.  The main aim is to give students the knowledge and skills to apply information theory to a wide variety of different systems. The course also gives a presentation of the connections between information theory and physics, primarily statistical mechanics and thermodynamics.Learning outcomes (after completion of the course the student should be able to)Define and apply fundamental concepts in information theory at a level where it becomes useful as a tool for problem solving, analysis and understanding.In the course you will be able to achieve this by, for example:- Defining and using the basic concepts of information theory: Shannon entropy, relative entropy, complexity measures based on these- Using information theory to characterise both cellular automata and low-dimensional chaos- Understanding the connection between information theory and statistical mechanics- Using geometric information theory to characterise patterns in spatically extended systems like pictures- Explaining how information is flowing in chemical self-organising systems exhibiting pattern formationContentBasic concepts of information theory- Shannon entropy, relative information, complexity measuresInformation theory for symbol sequences and lattice systems- correlations and randomness in symbol sequencesInformation theory and physics- entropy in physics and its relation to randomness in information theoryCellular automata- order and disorder in the time evolution of various cellular automaton rulesGeometric information theory- presentation of an information-theoretic framework for characterising patternsSelf-organising chemical systems- flows of information in the process of pattern formationChaotic systems and information- flows of information from micro to macro in chaotic systemsOrganisationThe course is based on a series of lectures, in total 30 hours, covering the topics listed above. Every week a set of home assignments are distributed. An optional mini project can also be done.LiteratureK. Lindgren,  Information theory for complex systems - An information perspective on complexity in dynamical systems, physics, and chemistry. Lecture notes, Chalmers, 2014.Examination including compulsory elementsThe examination will be based on a final written exam, with possibility of extra points from homework assignments and the optional mini project.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TIF150/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT471",
    "course_name": "Computational techniques for large-scale data",
    "description": "Course syllabus adopted 2025-02-03 by Head of Programme (or corresponding).Print pageOverviewSwedish nameBeräkningsmetoder för storskaliga dataCodeDAT471Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87135Maximum participants100(at least 10% of the seats are reserved for exchange students)Block scheduleAOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0125 Written and oral assignments4.5 cGrading: TH4.5 c0225 Examination3 cGrading: TH3 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPHPC - High-performance Computer Systems, Year 1(compulsory elective)ExaminerTo personal pageMatti KarppaSenior Lecturer,Data Science and AI, Computer Science and EngineeringContactkarppa@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible to the course, the student should have a Bachelor's degree in any subject, or have successfully completed 90 credits of studies in computer science, software engineering, or equivalent. Specifically, at least 15 credits of successfully completed courses in programming, including at least 7.5 credits in Python programming, or equivalent are required. The student needs to have successfully completed a course in probability theory or statistics, for example MVE051, TMS137 or similar.The course cannot be included in a degree which contains DAT345 or DAT346. Neither can the course be included in a degree which is based on another degree in which the course DAT345 or DAT346 is included.AimThe advent of big-data has led to the development of new programming paradigms, in particular for parallel systems allowing the computation with big data on redundant clusters of commodity computers. This course provides an introduction to different programming paradigms, e.g. MapReduce and extensions, which facilitate computations with Terabytes of data.  It also demonstrates that for specific tasks algorithms and data structures can provide highly efficient alternatives.Learning outcomes (after completion of the course the student should be able to)After completion of the course the student should be able to:Learning objectivesdiscuss important technological aspects when designing and implementing analysis solutions for large-scale data,explain differences between parallel programming modelsdescribe data structures and algorithms for big data and discuss their utilitySkills and abilitiesimplement applications for transforming and analyzing large-scale data with different parallel software frameworks,use algorithms and datastructures for computations with large-scale dataJudgement ability and approachsuggest appropriate computational infrastructures and methodological approaches for analysis tasks and discuss their advantages and drawbacks,discuss advantages and drawbacks of different strategies of parallelization,decide between algorithmic and parallelization-based approaches for accelerating computational workloadsContentThe aim of this course is to deepen the students knowledge and skills and familiarize them with the technical and technological side of data science, including software respectively hardware environments. The course will introduce aspects of designing and implementing large-scale data science solutions.In particular, the course will include:an overview of computer architectures, algorithmic approaches, and high- performance computing infrastructures with a focus on limitations for processing large-scale data,an introduction to relevant frameworks for cluster computing with large-scale data,implementation of data analysis tools on a cluster using Python and appropriate software frameworks,data structures and algorithms, such as index structures, which can greatly accelerate computations with large-scale dataOrganisationLectures, computer lab sessions, and exercise sessions.LiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsThe course is examined by a written hall examination, as well as mandatory written assignments, some of which will be carried out individually and others will be carried out in groups of normally 2-4 students.There will be non-obligatory individual assignments which grant bonus points for the written examination. These bonus points are valid for the two next scheduled re- examinations.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT471/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT475",
    "course_name": "Advanced databases",
    "description": "Course syllabus adopted 2021-02-17 by Head of Programme (or corresponding).Print pageOverviewSwedish nameAvancerade databaserCodeDAT475Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87124Block scheduleDOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0121 Written and oral assignments3 cGrading: UG3 c0221 Examination4.5 cGrading: TH4.5 c11 Okt 2025 am JIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 1(elective)MPCSC - Computer Systems and Cybersecurity, Year 1(elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPHPC - High-performance Computer Systems, Year 1(elective)ExaminerTo personal pageGraham KempProfessor,Data Science and AI, Computer Science and EngineeringContactkemp@chalmers.se+46 31 772 54 11To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesTo be eligible to the course, the student should have a Bachelor's degree in any subject, or have successfully completed 90 credits of studies in computer science, software engineering, or equivalent.Specifically, at least 15 credits of successfully completed courses in programming or equivalent are required. The student also needs to have attended a course in databases of at least 7.5 credits (e.g. TDA357 Databases or DAT335 Data management).AimDatabase management systems have been around for over fifty years. While relational database systems have been the dominant database technology, other kinds of non-relational systems have been in and out of fashion throughout that time, and today many applications are better supported by a variety of non-relational systems that have emerged in recent years. These include NoSQL systems, including graph databases, and systems based on Semantic Web standards. This course provides an overview of todays database management system landscape and highlights major trends. The course also includes concepts related to the implementation of database management systems since it is necessary to understand these concepts in order to appreciate the advantages and disadvantages of different database management systems. The purpose of this course is to provide a deeper understanding of databases, building on knowledge from an earlier introductory database course.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingdescribe concepts relating to the implementation of database management systemscompare and contrast features of relational and non-relational database management systemsSkills and abilitiesconstruct Web ontology language statements corresponding to an Entity-Relationship diagramconstruct RDF (Resource Description Framework) triples that contain data for a given domainimplement a graph database for a given domainretrieve data using declarative query languages for graph databasesJudgement ability and approachdiscuss advantages and disadvantages of different database design decisionsdiscuss advantages and disadvantages of alternative query plansdiscuss suitability of different database management systems for various tasksContentCourse contents:database management system architecture and implementationconcurrency and recoveryindexesquery processing and optimizationSemantic Web; RDF; RDF Schema; SPARQLontologiesNoSQL systems; aggregation-orientation; CAP theoremquerying graph databasesdatabase applicationsOrganisationThe course consists of weekly lectures and exercise sessions, as well as supervised lab sessions.LiteratureCourse literature to be announced the latest 8 weeks prior to the start of the course.Examination including compulsory elementsWritten individual exam given in an examination hall and programming assignments. The programming assignments are normally carried out in pairs.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT475/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DAT530",
    "course_name": "Research-oriented course in data science and AI",
    "description": "Course syllabus adopted 2022-02-01 by Head of Programme (or corresponding).Print pageOverviewSwedish nameForskningsinriktad kurs inom data science och AICodeDAT530Credits7.5 CreditsOwnerMPDSCEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Software Engineering, MathematicsDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1Course round 2Course round 3Course round 4EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code87115Block scheduleAOpen for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Project7.5 cGrading: TH7.5 cExaminerTo personal pageMarina Axelson-FiskProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmarina.axelson-fisk@chalmers.se+46 31 772 49 96To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code87117Open for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Project7.5 cGrading: TH7.5 cExaminerTo personal pageMarina Axelson-FiskProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmarina.axelson-fisk@chalmers.se+46 31 772 49 96To personal pageGo to coursepage(Opens in new tab)Course round 3Teaching languageEnglishApplication code87116Open for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Project7.5 cGrading: TH7.5 cExaminerTo personal pageMarina Axelson-FiskProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmarina.axelson-fisk@chalmers.se+46 31 772 49 96To personal pageGo to coursepage(Opens in new tab)Course round 4Teaching languageEnglishApplication code87112Open for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Project7.5 cGrading: TH7.5 cIn programmesMPDSC - Data Science and AI, Year 1(elective)ExaminerTo personal pageMarina Axelson-FiskProfessor,Applied Mathematics and Statistics, Mathematical SciencesContactmarina.axelson-fisk@chalmers.se+46 31 772 49 96To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThe student shall have a Bachelor's degree in a subject that is relevant for the MPDSC master programme.In addition, a mandatory pre-requisite to take this course is that the student has established a contact with the examiner of the course; it is up to the examiner to decide whether a student is accepted or not to the course.AimThis course will deal with an area of current interest in data science and AI.The aim of this course is to give the student the chance to follow, for example, a graduate course or a lecture series by a visiting researcher at the department.Learning outcomes (after completion of the course the student should be able to)The course shall give the student further knowledge in a research area of relevance to data science and AI.Knowledge and understandingMaster the terminology, concepts and theories associated with the selected area;Demonstrate deep knowledge and understanding in the area of the course, and insight into current research and development;Demonstrate deep methodological knowledge in the area of the course;Skills and abilitiesDemonstrate the ability to critically and systematically integrate knowledge and to analyse, assess, and deal with complex issues in the area of the course;Judgement and approachSearch for, and extract, necessary information from scientific publications in the selected area of the course, with the purpose of identifying strengths and weakness of solutions, approaches and methodologies.ContentResearch-oriented course in a field of relevance to data science and AI.The particular content will be determined prior to each instance of this course and will be made available on the course home pageOrganisationThe organisation of the course may include lectures, tutorials, seminars, and/or labs and supervision in conjunction with these.LiteratureThe course literature will be published on the course home page.Examination including compulsory elementsThe examination might vary on each instance of the course. It might consist of a written or take home exam, assignments, presentation of work in a seminar, or a combination of these.Further information will be given on the course home page.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DAT530/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE166",
    "course_name": "Linear and integer optimization with applications",
    "description": "Course syllabus adopted 2023-02-14 by Head of Programme (or corresponding).Print pageOverviewSwedish nameLinjär och heltalsoptimering med tillämpningarCodeMVE166Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20163Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0122 Examination, part A 6 cGrading: TH6 c07 Jan 2026 am J0222 Project, part B 1.5 cGrading: UG1.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPSYS - Systems, Control and Mechatronics, Year 1(compulsory elective)TKAUT - Automation and Mechatronics Engineering, Year 3(elective)TKTEM - Engineering Mathematics, Year 2(elective)ExaminerTo personal pageAnn-Brith StrömbergFull Professor,Applied Mathematics and Statistics, Mathematical SciencesContactanstr@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesLinear algebra, analysis in one and in several variables. Basic knowledge in MATLAB is desirable.AimA main purpose with the course is to give the students an overview of\nimportant areas where optimization problems often are considered in\napplications, and an overview of some important practical techniques for\ntheir solution. Another purpose of the course is to provide insights into\nsuch problem areas from both a application and theoretical perspective,\nincluding the the analysis of an optimization model and suitable choices\nof\nsolution approaches. Work with concrete problems during the course enable\nthe establishment of these insights.Learning outcomes (after completion of the course the student should be able to)After completion of the course the student should be able toidentify the most important principles for describing linear and integer optimization problems as mathematical optimization models;distinguish between and model problems from some important classes of linear and integer optimization problems.utilize linear programming duality for sensitivity analysis of optimal solutions to such problems.Within each problem class the student should, after completion of the course, be able todevelop mathematical models of relevant problems within the class;identify and describe the most important and useful mathematical properties of the developed models;select, adapt, or develop convergent and efficient suitable solution techniques and algorithms for problems within the class;implement the chosen/developed algorithms in appropriate software;interpret and assess the plausibility of the obtained solutions in relation to the original problem setting;examine the sensitivity of a resulting optimal solution with respect to changes in the problem data;explain the results of the sensitivity analysis in relation to the models at hand.ContentThis course describes with the aid of, e.g., case studies how linear and integer optimization problems are modelled and solved in practice.Some typical problems and algorithms that are covered are investment, blending, models of energy systems, production and maintenance planning, network models, routing and transport problems, multi-objective optimization, and inventory planning; the simplex method for linear programming, heuristics, the branch-and-bound algorithm.OrganisationA lecture series of mathematical material; exercise sessions; project work; advisement sessions. Additionally, there might be voluntary elements that could give bonus points for the written exam.LiteratureSee the course home page.Examination including compulsory elementsPassed project assignments; a written opposition; a written exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE166/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVE441",
    "course_name": "Statistical learning for big data",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameStatistik för stora datamängderCodeMVE441Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20129Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0120 Project1.5 cGrading: UG1.5 c0220 Take-home examination6 cGrading: TH6 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)ExaminerTo personal pageRebecka JörnstenFull Professor,Applied Mathematics and Statistics, Mathematical SciencesContactjornsten@chalmers.se+46 31 772 35 34To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesThe prerequisites for the course are a basic course in statistical inference and MVE190 Linear Statistical Models. Students can also contact the course instructor for permission to take the course.AimThe course should give understanding of and training in techniques for statistical analysis of large data sets.Learning outcomes (after completion of the course the student should be able to)demonstrate\r\n\tunderstanding of the key concepts and ideas concerning\r\n\tclassification, clustering and dimension reduction.solve high-dimensional data analysis exercises and interpret the results of such analyses.ContentOverview\r\n\tof high-dimensional data analysisClassification:\r\n\tBayes rule, discriminant analysis methods, nearest neighbor\r\n\tclassifier, classification and regression trees.Cost\r\n\tfunctions, greedy searches, gradient descent, cross-validation.Logistic\r\n\tregressionRegularization\r\n\tmethods. Sparse logistic regression, sparse discriminant analysis.Ensemble\r\n\tmethods: bagging, random projections, random forests.Clustering:\r\n\tk-means, hierarchical clustering, model-based clustering, spectral\r\n\tmethods.Dimension\r\n\treduction: PCA, canonical correlation, multi-dimensional scaling.Special\r\n\ttopics (subset of the following): networks and graphical models,\r\n\tsparse covariance estimation, network clustering and community\r\n\tdetection, neural networks, matrix completion, collaborative\r\n\tfiltering.Large-scale\r\n\tlearning: stochastic searches, batch-methods, online learning.OrganisationThe teaching is organized with lectures, discussions, and reading assignments.LiteratureTo be announced.Examination including compulsory elementsOral and/or written examination.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVE441/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "SSY098",
    "course_name": "Image analysis",
    "description": "Course syllabus adopted 2023-02-16 by Head of Programme (or corresponding).Print pageOverviewSwedish nameBildanalysCodeSSY098Credits7.5 CreditsOwnerMPMEDEducation cycleSecond-cycleMain field of studyBioengineering, Electrical Engineering, Biomedical engineeringDepartmentELECTRICAL ENGINEERINGGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code41117Block scheduleCOpen for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0119 Project3.5 cGrading: TH3.5 c0219 Laboratory4 cGrading: TH4 cIn programmesMPDSC - Data Science and AI, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)MPMED - Biomedical Engineering, MSc Progr, Year 1(compulsory elective)MPSYS - Systems, Control and Mechatronics, Year 1(elective)TKAUT - Automation and Mechatronics Engineering, Year 3(elective)ExaminerTo personal pageJennifer AlvénAssistant Professor,Signal Processing and Biomedical Engineering, Electrical EngineeringContactalven@chalmers.se+46 31 772 17 58To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesA basic course in Signals and Systems (or the equivalent) including the Fourier Transform, linear filter theory (impulse response, transfer function, convolution, sampling theorem). Working knowledge of probability theory.AimThe main aim of the course is to give a basic introduction to the algorithms and mathematical methods used in image analysis, to an extent that will allow the student to handle industrial image analysis problems. In addition the aim is to help the student develop his or her ability in problem solving, both with or without a computer.Learning outcomes (after completion of the course the student should be able to)Knowledge and understandingFor a passing grade the student must- be able to explain clearly, and to independently use, basic mathematical concepts in image analysis.- be able to describe and give an informal explanation of the mathematical theory behind some central image analysis algorithms (both deterministic and stochastic).- have an understanding of the statistical principles used in machine learning.Competences and skillsFor a passing grade the student must- in an engineering manner be able to use computer packages to solve problems in image analysis.- show good capability to independently identify problems which can be solved with methods from image analysis, and be able to choose an appropriate method.- be able to independently apply basic methods in image analysis to problems which are relevant in industrial applications or research.- with proper terminology, in a well structured way and with clear logic be able to explain the solution to a problem in image analysis.ContentBasic image analysis tools: Filtering and scale space representations.Extraction of image features: Blob, edge and corner detection.Image similarity: Correlation, mutual information and the SIFT descriptor.Image registration: Robust model fitting and RANSAC.Basics of computer vision: camera geometry, epipolar geometry and motion estimationMachine learning-based methods for classification and segmentation: Nearest neighbour and convolutional nets.Applications: Computer-aided diagnostics (segmentation, alignment, classification), robotic vision (motion estimation, object/scene recognition) and image search.OrganisationThe course consists of a number of lectures (including guest lectures given by industry and / or academic researchers showcasing practical applications of image analysis). In addition there are a number of exercise sessions, four laboratory sessions and one project. The laboratory sessions may be carried out individually or in groups, but the project needs to be carried out individually. The project involves the submission of a written report explaining the image analysis problem at hand, a motivation of the chosen theory and algorithms, results and conclusions.LiteratureOptional: Szeliski, R.: Computer Vision, Algorithms and Applications. Springer, 2010, ISBN: 9781848829343.optional: Goodfellow, I. and Bengio, Y. and Courville, Deep Learning. MIT Press, 2016, ISBN: 9780262035613.It is possible to pass the course without owning the books, using material available through the course page. Both books are available online for free (as pre-prints).Examination including compulsory elementsThere is no written exam in this course. Students will be graded based on the project and will need to pass the laboratory sessions. Optional exercises in the laboratory will count towards higher grades (only if the passing grade is reached).The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/SSY098/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMS016",
    "course_name": "Spatial statistics and image analysis",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameSpatial statistik och bildanalysCodeTMS016Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20122Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0101 Examination7.5 cGrading: TH7.5 cIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)MPICT - Information and Communication Technology, Year 1(compulsory elective)ExaminerTo personal pageOttmar CronieDirector of Graduate Studies,Mathematical SciencesContactottmar@chalmers.se+46 31 772 40 42To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesOne basic course in mathematical statistics as well as MVE170 or a similar course on stochastic processes.AimThe aim of the course is to provide basic knowledge of models and methods with practical applications in spatial statistics and image analysis.Learning outcomes (after completion of the course the student should be able to)- perform basic image processing, including filtering and noise reduction.- Identify and describe stochastic models and methods for problems in spatial statistics and image analysis.- Implement computer programs for solving statistical problems in image analysis with a given method.- Report motivations, approaches and conclusions when solving a given statistical problem, both in writing and orally.- Suggest and analyze stochastic models for problems in spatial statistics and image analysis.ContentBasic methods of filtering and pattern recognition in images. Statistical methods for classification and reconstruction. Stochastic fields, Gaussian fields, Markov fields, Gaussian Markov random fields, and point processes. Covariance functions, kriging, and simulation methods for stochastic inference. Applications to climate, environmental statistics, remote sensing, microscopy, photography, and medical imaging.OrganisationLectures and computer exercises where MATLAB or R is used. An important part of the course is project work that is presented in a project report and at a seminar.LiteratureListed on the course homepage no later than eight weeks before the course starts.Examination including compulsory elementsThe assessment is based on a written exam and project work.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "credits": 16.0,
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMS016/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "TMS088",
    "course_name": "Financial time series",
    "description": "Course syllabus adopted 2021-02-26 by Head of Programme (or corresponding).Print pageOverviewSwedish nameFinansiella tidsserierCodeTMS088Credits7.5 CreditsOwnerMPENMEducation cycleSecond-cycleMain field of studyMathematicsDepartmentMATHEMATICAL SCIENCESGradingTH - Pass with distinction (5), Pass with credit (4), Pass (3), FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationLiteratureExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code20127Open for exchange studentsYesCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0117 Examination7.5 cGrading: TH7.5 c05 Jan 2026 am JIn programmesMPCAS - Complex Adaptive Systems, Year 1(compulsory elective)MPDSC - Data Science and AI, Year 1(compulsory elective)MPENM - Engineering Mathematics and Computational Science, Year 1(compulsory elective)TKIEK - Industrial Engineering and Management - Financial mathematics, Year 3(compulsory)ExaminerTo personal pagePeter HelgessonAdjunct Senior Lecturer,Analysis and Probability Theory, Mathematical SciencesContacthelgessp@chalmers.seTo personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Applicants enrolled in a programme at Chalmers where the course is included in the study programme are exempted from fulfilling the requirements above.Course specific prerequisitesGood knowledge of calculus and linear algebra, knowledge of basic probability and statistics. Some knowledge of stochastic processes and programming in matlab is highly desirable.AimStudents will gain an understanding of the classical time-series theory \r\nand practice with an emphasis on the modeling of financial time series. \r\nThey will develop an appreciation of the issues, goals and approaches of \r\nthis theory through being exposed to basic probabilistic models, tools, \r\nand statistical estimation methods specific to this field. In the frame \r\nof the general time-series set-up they will develop an appreciation of the specific issues \r\nrelated to the analysis and forecasting of financial returns.Learning outcomes (after completion of the course the student should be able to)Compute and interpret marginal distributions and autocorrelation functions in time seriesDerive the properties of ARIMA and GARCH modelsChoose an appropriate ARIMA/GARCH model for a given set of data and fit the model using an appropriate packageCompute forecasts for a variety of linear and non-linear methods and modelsContentThis course introduces time series techniques and their application to the analysis and forecasting of financial time series. Topics covered include:ARIMA models - probabilistic properties and estimationStationary processesThe autocovariance and the autocorrelation functionsBasic properties of ARMA processesLinear process representationEstimation of ARMA processesARCH and GARCH processes - theory and practice of volatility modelingThe ARCH family, definition and relation with ARMA processesExtensions of GARCH processesNonlinear modelsBilinear models and Markov switch autoregressive modelsModel fitting using kernel regression, bandwidth selection, and local linear regressionNon-parametric and parametric tests for non-linearityForecasting and prediction performance measuresOrganisationThe theoretical discourse is supplemented by hands-on data analysis. Familiarity with a statistical software analysis tool (like Matlab, Splus, R) is assumed.LiteratureThe course literature is given on a separate list.Examination including compulsory elementsWritten exam. Programming exercises to gain bonus points for the final exam.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "elective",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/TMS088/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DATX60",
    "course_name": "Master's thesis in Computer science and engineering",
    "description": "Course syllabus adopted 2024-01-30 by Vice President (or corresponding).Print pageOverviewSwedish nameMasterexamensarbete vid Data- och informationsteknikCodeDATX60Credits60 CreditsOwnerTKITEEducation cycleSecond-cycleMain field of studyComputer Science and Engineering, Electrical Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingUG - Pass, FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code52112Open for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0109 Diploma thesis, part A 30 cGrading: UG15 c15 c0209 Diploma thesis, part B 30 cGrading: UG15 c15 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 2MPCSN - Computer Systems and Networks, Year 2MPDSC - Data Science and AI, Year 2MPHPC - High-performance Computer Systems, Year 2MPIDE - Interaction Design and Technologies, Year 2MPSOF - Software Engineering and Technology, Year 2ExaminerTo personal pageStaffan BjörkFull Professor,Interaction Design and Software Engineering, Computer Science and EngineeringContactstaffan.bjork@cse.gu.se+46 31 772 10 39To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Course specific prerequisitesStudents pursuing the five-year Master of Science in Engineering/Master of Architecture education must have accrued at least 225 hec before beginning work on a thesis.Students who are only taking part in the Master's programme must have accrued at least 45 hec in this programme before beginning work on a thesis.In addition to the general credit requirements, the necessary prerequisite courses must be completed for the specific thesis. The examiner will formulate and monitor these prerequisite requirements.AimThe purpose of a thesis is to enable the student to develop deeper knowledge, understanding, capabilities and attitudes in the context of the programme of study. The thesis should be written at the end of the programme and offers the opportunity to delve more deeply into and synthesise knowledge acquired in previous studies. A thesis for a Master of Science in Engineering/Master of Architecture or Master of Science programmes should place emphasis on the technical/scientific/architectural aspects of the subject matter.Learning outcomes (after completion of the course the student should be able to)The learning objectives for a thesis are based on the objectives for Master of Science in Engineering/ Architecture/Master of Science degrees formulated in Chalmers' local Master's degree procedures.Specific learning objectives that are to be fulfilled in the master's thesis are that the student should be able to:in their project use essential in-depth knowledge of the major subject/field of study and, in a scientifically correct way, relate to current research and development work;choose and state one's reasons for selecting their project method with respect to the major subject/field of study;contribute to research and development work, and be able to relate their work to relevant scientific or technical/industrial/architectonic contexts;based on a holistic view, critically, independently and creatively identify, formulate and deal with complex issues;plan and, with adequate methods, carry out qualified tasks within the designated framework and also be able to evaluate this work;create, analyse and critically evaluate different technical/architectonic solutions;critically and systematically integrate knowledge;present and discuss their conclusions as well as the knowledge and arguments these are based upon both in spoken and written English;within the framework for the specific project, identify which issues need to be addressed for relevant societal, ethical and ecological factors to be observed, andobserve and discuss ethical aspects of research and development work, both pertaining to how the work is carried out as well as what it explores/develops;identify and discuss needs for further elucidation of different project aspects before decision-making or project realisation, when relevant.Upon completion of the degree work, the student shall have demonstrated such knowledge and ability as are required to work independently as a Master of Architecture/Master of Science in Engineering/ Master of Science.ContentThe task consists of independent work, which can be carried out individually or in pairs. The task includes topic selection, problem formulation and problem definition, literature studies, empirical data collection including practical experiments, development, preparation of a report as well as presentation and defense of the report at a seminar. The report must meet certain scientific criteria. The course also includes opposition on another group's thesis report.OrganisationInitiationThe thesis is to be written by a single student or two students working together.The student contacts an examiner or the master program responsible can suggest an examiner.The student formulates a brief written description of the topic for the thesis. The description should contain the background, purpose, objective and possibly the method.The examiner will ensure that the student and the project meet the requirements for general and specific prerequisites and the general intended learning outcomes for theses.The master program responsible ensures that the thesis falls within the main subject of the Master's programme. If the student is accepted in a five years program for Master of Science in Engineering or Architecture, the master program responsible should as well assess and approve that the master thesis is relevant for the appropriate technical/architectural subject area.The student submits information of the thesis project via the web form at Chalmer's education pages, Your studies. The examiner and the master program responsible sign their approval before registration in Ladok is done.PlanningThe student must write a planning report providing a detailed description of the problem/task. The planning report must contain the background, purpose, objective, scope, method and timetable for completion of the thesis. The planning report is submitted to the examiner for approval.SupervisionThe students are entitled to guidance during the course of their work.Interim reportingAfter twenty working weeks on a 60 hec thesis, the student must report the status of the work to the examiner and the master program responsible. An approved interim report results in 30 hec being registered in Ladok.Written reportThe thesis must be written in English.The cover, etc., of the thesis must be formulated according to the instruction and templates at \"Design and Publish master Thesis\" at Chalmers. See Chalmers Education pages, Your studies.The thesis must be parsed using anti-plagiarism software.Chalmers' policies regarding open access and confidentiality apply to the work on the thesis and to publishing the report and the master thesis in whole should be open access.The thesis must be published electronically in Chalmers Open Digital Repository (ODR) Student theses according to the applicable rules for electronic publication of theses at Chalmers.When two students work jointly on a thesis, the division of the work must be clearly stated in the thesis.Oral presentationThe oral presentation begins with the student describing the work. This is followed by a defense of the findings, and a discussion.The oral presentation must be made in English. This presentation may not take more than 60 minutes, of which approximately 1/3 of the time should be devoted to a defense of the thesis and discussion.At the time of the oral presentation, the written thesis must be completed but not published. This is to make it possible to include viewpoints that arise during the oral presentation to be incorporated into the thesis.The oral presentation, including a defense of the thesis, must be done at Chalmers at an open seminar. Any additional presentations can be made at a company or other external organisations, if necessary. In exceptional cases, for example, if thesis research has been conducted abroad, the examiner may grant a dispensation from the requirement for an oral presentation, defense of the findings in the thesis and presence at other presentations at Chalmers.The presentation of the thesis must be announced at the department at least two weeks prior to the date of the presentation. The presentation must be held in the period between August 15 and June 15, during normal office hours.Additional information on the execution of the master thesis work can be available at the department.Examination including compulsory elementsFor a thesis to be approved, the following stages must be completed:An approved planning reportAn approved thesisAn approved presentation and defense of the thesisApproved opposition of another thesisAttendance of the presentation and defense of two other thesesFor a 60 hec thesis, an interim report must be submitted when the work has reached the halfway point. The examiner will decide on the form for the interim report. When the interim report has been approved, 30 hec will be registered in Ladok.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "thesis",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DATX60/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVEX60",
    "course_name": "Master's thesis in Mathematics",
    "description": "Course syllabus adopted 2024-01-30 by Vice President (or corresponding).Print pageOverviewSwedish nameMasterexamensarbete vid Matematiska vetenskaperCodeMVEX60Credits60 CreditsOwnerTKTEMEducation cycleSecond-cycleMain field of studyBioengineering, Software Engineering, MathematicsDepartmentMATHEMATICAL SCIENCESGradingUG - Pass, FailContent on this pageCourse round 1EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code59125Open for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0109 Diploma thesis, part A 30 cGrading: UG15 c15 c0209 Diploma thesis, part B 30 cGrading: UG15 c15 cIn programmesMPDSC - Data Science and AI, Year 2MPENM - Engineering Mathematics and Computational Science, Year 2ExaminerTo personal pageStefan LemurellAssociate Professor,Algebra and Geometry, Mathematical SciencesContactsj@chalmers.se+46 31 772 53 03To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Course specific prerequisitesStudents pursuing the five-year Master of Science in Engineering/Master of Architecture education must have accrued at least 225 hec before beginning work on a thesis.Students who are only taking part in the Master*s programme must have accrued at least 45 hec in this programme before beginning work on a thesis.In addition to the general credit requirements, the necessary prerequisite courses must be completed for the specific thesis. The examiner will formulate and monitor these prerequisite requirements.AimThe purpose of a thesis is to enable the student to develop deeper knowledge, understanding, capabilities and attitudes in the context of the programme of study. The thesis should be written at the end of the programme and offers the opportunity to delve more deeply into and synthesise knowledge acquired in previous studies. A thesis for a Master of Science in Engineering/Master of Architecture or Master of Science programmes should place emphasis on the technical/scientific/architectural aspects of the subject matter.Learning outcomes (after completion of the course the student should be able to)The learning objectives for a thesis are based on the objectives for Master of Science in Engineering/ Architecture/Master of Science degrees formulated in Chalmers' local Master's degree procedures.Specific learning objectives that are to be fulfilled in the master's thesis are that the student should be able to:in their project use essential in-depth knowledge of the major subject/field of study and, in a scientifically correct way, relate to current research and development work;choose and state one's reasons for selecting their project method with respect to the major subject/field of study;contribute to research and development work, and be able to relate their work to relevant scientific or technical/industrial/architectonic contexts;based on a holistic view, critically, independently and creatively identify, formulate and deal with complex issues;plan and, with adequate methods, carry out qualified tasks within the designated framework and also be able to evaluate this work;create, analyse and critically evaluate different technical/architectonic solutions;critically and systematically integrate knowledge;present and discuss their conclusions as well as the knowledge and arguments these are based upon both in spoken and written English;within the framework for the specific project, identify which issues need to be addressed for relevant societal, ethical and ecological factors to be observed, andobserve and discuss ethical aspects of research and development work, both pertaining to how the work is carried out as well as what it explores/develops;identify and discuss needs for further elucidation of different project aspects before decision-making or project realisation, when relevant.Upon completion of the degree work, the student shall have demonstrated such knowledge and ability as are required to work independently as a Master of Architecture/Master of Science in Engineering/ Master of Science.ContentThe task consists of independent work, which can be carried out individually or in pairs. The task includes topic selection, problem formulation and problem definition, literature studies, empirical data collection including practical experiments, development, preparation of a report as well as presentation and defense of the report at a seminar. The report must meet certain scientific criteria. The course also includes opposition on another group's thesis report.OrganisationInitiationThe thesis is to be written by a single student or two students working together.The student contacts an examiner or the master program responsible can suggest an examiner.The student formulates a brief written description of the topic for the thesis. The description should contain the background, purpose, objective and possibly the method.The examiner will ensure that the student and the project meet the requirements for general and specific prerequisites and the general intended learning outcomes for theses.The master program responsible ensures that the thesis falls within the main subject of the Master's programme. If the student is accepted in a five years program for Master of Science in Engineering or Architecture, the master program responsible should as well assess and approve that the master thesis is relevant for the appropriate technical/architectural subject area.The student submits information of the thesis project via the web form at Chalmer's education pages, Your studies. The examiner and the master program responsible sign their approval before registration in Ladok is done.PlanningThe student must write a planning report providing a detailed description of the problem/task. The planning report must contain the background, purpose, objective, scope, method and timetable for completion of the thesis. The planning report is submitted to the examiner for approval.SupervisionThe students are entitled to guidance during the course of their work.Interim reportingAfter twenty working weeks on a 60 hec thesis, the student must report the status of the work to the examiner and the master program responsible. An approved interim report results in 30 hec being registered in Ladok.Written reportThe thesis must be written in English.The cover, etc., of the thesis must be formulated according to the instruction and templates at \"Design and Publish master Thesis\" at Chalmers. See Chalmers Education pages, Your studies.The thesis must be parsed using anti-plagiarism software.Chalmers' policies regarding open access and confidentiality apply to the work on the thesis and to publishing the report and the master thesis in whole should be open access.The thesis must be published electronically in Chalmers Open Digital Repository (ODR) Student theses according to the applicable rules for electronic publication of theses at Chalmers.When two students work jointly on a thesis, the division of the work must be clearly stated in the thesis.Oral presentationThe oral presentation begins with the student describing the work. This is followed by a defense of the findings, and a discussion.The oral presentation must be made in English. This presentation may not take more than 60 minutes, of which approximately 1/3 of the time should be devoted to a defense of the thesis and discussion.At the time of the oral presentation, the written thesis must be completed but not published. This is to make it possible to include viewpoints that arise during the oral presentation to be incorporated into the thesis.The oral presentation, including a defense of the thesis, must be done at Chalmers at an open seminar. Any additional presentations can be made at a company or other external organisations, if necessary. In exceptional cases, for example, if thesis research has been conducted abroad, the examiner may grant a dispensation from the requirement for an oral presentation, defense of the findings in the thesis and presence at other presentations at Chalmers.The presentation of the thesis must be announced at the department at least two weeks prior to the date of the presentation. The presentation must be held in the period between August 15 and June 15, during normal office hours.Additional information on the execution of the master thesis work can be available at the department.Examination including compulsory elementsFor a thesis to be approved, the following stages must be completed:An approved planning reportAn approved thesisAn approved presentation and defense of the thesisApproved opposition of another thesisAttendance of the presentation and defense of two other thesesFor a 60 hec thesis, an interim report must be submitted when the work has reached the halfway point. The examiner will decide on the form for the interim report. When the interim report has been approved, 30 hec will be registered in Ladok.The course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "course_type": "thesis",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVEX60/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "DATX05",
    "course_name": "Master's thesis in Computer science and engineering",
    "description": "Course syllabus adopted 2024-01-30 by Vice President (or corresponding).Print pageOverviewSwedish nameMasterexamensarbete vid Data- och informationsteknikCodeDATX05Credits30 CreditsOwnerTKITEEducation cycleSecond-cycleMain field of studyAutomation and Mechatronics Engineering, Computer Science and Engineering, Electrical Engineering, Software EngineeringDepartmentCOMPUTER SCIENCE AND ENGINEERINGGradingUG - Pass, FailContent on this pageCourse round 1Course round 2EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code52129Open for exchange studentsNoCredit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0108 Diploma thesis30 cGrading: UG15 c15 cExaminerTo personal pageStaffan BjörkFull Professor,Interaction Design and Software Engineering, Computer Science and EngineeringContactstaffan.bjork@cse.gu.se+46 31 772 10 39To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code52140Open for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0108 Diploma thesis30 cGrading: UG15 c15 cIn programmesMPALG - Computer Science - Algorithms, Languages and Logic, Year 2MPCSN - Computer Systems and Networks, Year 2MPDSC - Data Science and AI, Year 2MPHPC - High-performance Computer Systems, Year 2MPIDE - Interaction Design and Technologies, Year 2MPSOF - Software Engineering and Technology, Year 2MPSYS - Systems, Control and Mechatronics, Year 2ExaminerTo personal pageStaffan BjörkFull Professor,Interaction Design and Software Engineering, Computer Science and EngineeringContactstaffan.bjork@cse.gu.se+46 31 772 10 39To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Course specific prerequisitesStudents pursuing the five-year Master of Science in Engineering/Master of Architecture education must have accrued at least 225 hec before beginning work on a thesis.Students who are only taking part in the Master's programme must have accrued at least 45 hec in this programme before beginning work on a thesis.In addition to the general credit requirements, the necessary prerequisite courses must be completed for the specific thesis. The examiner will formulate and monitor these prerequisite requirements.AimThe purpose of a thesis is to enable the student to develop deeper knowledge, understanding, capabilities and attitudes in the context of the programme of study. The thesis should be written at the end of the programme and offers the opportunity to delve more deeply into and synthesise knowledge acquired in previous studies. A thesis for a Master of Science in Engineering/Master of Architecture or Master of Science programmes should place emphasis on the technical/scientific/architectural aspects of the subject matter.Learning outcomes (after completion of the course the student should be able to)The learning objectives for a thesis are based on the objectives for Master of Science in Engineering/ Architecture/Master of Science degrees formulated in Chalmers' local Master's degree procedures.Specific learning objectives that are to be fulfilled in the master's thesis are that the student should be able to:in their project use essential in-depth knowledge of the major subject/field of study and, in a scientifically correct way, relate to current research and development work;choose and state one's reasons for selecting their project method with respect to the major subject/field of study;contribute to research and development work, and be able to relate their work to relevant scientific or technical/industrial/architectonic contexts;based on a holistic view, critically, independently and creatively identify, formulate and deal with complex issues;plan and, with adequate methods, carry out qualified tasks within the designated framework and also be able to evaluate this work;create, analyse and critically evaluate different technical/architectonic solutions;critically and systematically integrate knowledge;present and discuss their conclusions as well as the knowledge and arguments these are based upon both in spoken and written English;within the framework for the specific project, identify which issues need to be addressed for relevant societal, ethical and ecological factors to be observed, andobserve and discuss ethical aspects of research and development work, both pertaining to how the work is carried out as well as what it explores/develops;identify and discuss needs for further elucidation of different project aspects before decision-making or project realisation, when relevant.Upon completion of the degree work, the student shall have demonstrated such knowledge and ability as are required to work independently as a Master of Architecture/Master of Science in Engineering/ Master of Science.ContentThe task consists of independent work, which can be carried out individually or in pairs. The task includes topic selection, problem formulation and problem definition, literature studies, empirical data collection including practical experiments, development, preparation of a report as well as presentation and defense of the report at a seminar. The report must meet certain scientific criteria. The course also includes opposition on another group's thesis report.OrganisationInitiationThe thesis is to be written by a single student or two students working together.The student contacts an examiner or the master program responsible can suggest an examiner.The student formulates a brief written description of the topic for the thesis. The description should contain the background, purpose, objective and possibly the method.The examiner will ensure that the student and the project meet the requirements for general and specific prerequisites and the general intended learning outcomes for theses.The master program responsible ensures that the thesis falls within the main subject of the Master's programme. If the student is accepted in a five years program for Master of Science in Engineering or Architecture, the master program responsible should as well assess and approve that the master thesis is relevant for the appropriate technical/architectural subject area.The student submits information of the thesis project via the web form at Chalmer's education pages, Your studies. The examiner and the master program responsible sign their approval before registration in Ladok is done.PlanningThe student must write a planning report providing a detailed description of the problem/task. The planning report must contain the background, purpose, objective, scope, method and timetable for completion of the thesis. The planning report is submitted to the examiner for approval.SupervisionThe students are entitled to guidance during the course of their work.Written reportThe thesis must be written in English.The cover, etc., of the thesis must be formulated according to the instruction and templates at \"Design and Publish master Thesis\" at Chalmers. See Chalmers Education pages, Your studies.The thesis must be parsed using anti-plagiarism software.Chalmers' policies regarding open access and confidentiality apply to the work on the thesis and to publishing the report and the master thesis in whole should be open access.The thesis must be published electronically in Chalmers Open Digital Repository (ODR) Student theses according to the applicable rules for electronic publication of theses at Chalmers.When two students work jointly on a thesis, the division of the work must be clearly stated in the thesis.Oral presentationThe oral presentation begins with the student describing the work. This is followed by a defense of the findings, and a discussion.The oral presentation must be made in English. This presentation may not take more than 60 minutes, of which approximately 1/3 of the time should be devoted to a defense of the thesis and discussion.At the time of the oral presentation, the written thesis must be completed but not published. This is to make it possible to include viewpoints that arise during the oral presentation to be incorporated into the thesis.The oral presentation, including a defense of the thesis, must be done at Chalmers at an open seminar. Any additional presentations can be made at a company or other external organisations, if necessary. In exceptional cases, for example, if thesis research has been conducted abroad, the examiner may grant a dispensation from the requirement for an oral presentation, defense of the findings in the thesis and presence at other presentations at Chalmers.The presentation of the thesis must be announced at the department at least two weeks prior to the date of the presentation. The presentation must be held in the period between August 15 and June 15, during normal office hours.Additional information on the execution of the master thesis work can be available at the department.Examination including compulsory elementsFor a thesis to be approved, the following stages must be completed:An approved planning reportAn approved thesisAn approved presentation and defense of the thesisApproved opposition of another thesisAttendance of the presentation and defense of two other thesesThe course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "credits": 5.0,
    "course_type": "thesis",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/DATX05/",
    "scraped_date": "2025-12-09"
  },
  {
    "course_code": "MVEX03",
    "course_name": "Master's thesis in Mathematics",
    "description": "Course syllabus adopted 2024-01-30 by Vice President (or corresponding).Print pageOverviewSwedish nameMasterexamensarbete vid Matematiska vetenskaperCodeMVEX03Credits30 CreditsOwnerTKTEMEducation cycleSecond-cycleMain field of studyAutomation and Mechatronics Engineering, Bioengineering, Electrical Engineering, Software Engineering, MathematicsDepartmentMATHEMATICAL SCIENCESGradingUG - Pass, FailContent on this pageCourse round 1Course round 2EligibilitySpecific entry requirementsCourse specific prerequisitesAimLearning outcomes (after completion of the course the student should be able to)ContentOrganisationExamination including compulsory elementsCourse round 1Teaching languageEnglishApplication code59129Open for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0108 Diploma thesis30 cGrading: UG15 c15 cExaminerTo personal pageStefan LemurellAssociate Professor,Algebra and Geometry, Mathematical SciencesContactsj@chalmers.se+46 31 772 53 03To personal pageGo to coursepage(Opens in new tab)Course round 2Teaching languageEnglishApplication code59126Open for exchange studentsNoOnly students with the course round in the programme overview.Credit distributionModuleSp1Sp2Sp3Sp4SummerNot SpExamination dates0108 Diploma thesis30 cGrading: UG15 c15 cIn programmesMPDSC - Data Science and AI, Year 2MPENM - Engineering Mathematics and Computational Science, Year 2MPSYS - Systems, Control and Mechatronics, Year 2ExaminerTo personal pageStefan LemurellAssociate Professor,Algebra and Geometry, Mathematical SciencesContactsj@chalmers.se+46 31 772 53 03To personal pageGo to coursepage(Opens in new tab)EligibilityGeneral entry requirements for Master's level (second cycle)Specific entry requirementsEnglish 6 (or by other approved means with the equivalent proficiency level)Course specific prerequisitesStudents pursuing the five-year Master of Science in Engineering/Master of Architecture education must have accrued at least 225 hec before beginning work on a thesis.Students who are only taking part in the Master's programme must have accrued at least 45 hec in this programme before beginning work on a thesis.In addition to the general credit requirements, the necessary prerequisite courses must be completed for the specific thesis. The examiner will formulate and monitor these prerequisite requirements.AimThe purpose of a thesis is to enable the student to develop deeper knowledge, understanding, capabilities and attitudes in the context of the programme of study. The thesis should be written at the end of the programme and offers the opportunity to delve more deeply into and synthesise knowledge acquired in previous studies. A thesis for a Master of Science in Engineering/Master of Architecture or Master of Science programmes should place emphasis on the technical/scientific/architectural aspects of the subject matter.Learning outcomes (after completion of the course the student should be able to)The learning objectives for a thesis are based on the objectives for Master of Science in Engineering/ Architecture/Master of Science degrees formulated in Chalmers' local Master's degree procedures.Specific learning objectives that are to be fulfilled in the master's thesis are that the student should be able to:in their project use essential in-depth knowledge of the major subject/field of study and, in a scientifically correct way, relate to current research and development work;choose and state one's reasons for selecting their project method with respect to the major subject/field of study;contribute to research and development work, and be able to relate their work to relevant scientific or technical/industrial/architectonic contexts;based on a holistic view, critically, independently and creatively identify, formulate and deal with complex issues;plan and, with adequate methods, carry out qualified tasks within the designated framework and also be able to evaluate this work;create, analyse and critically evaluate different technical/architectonic solutions;critically and systematically integrate knowledge;present and discuss their conclusions as well as the knowledge and arguments these are based upon both in spoken and written English;within the framework for the specific project, identify which issues need to be addressed for relevant societal, ethical and ecological factors to be observed, andobserve and discuss ethical aspects of research and development work, both pertaining to how the work is carried out as well as what it explores/develops;identify and discuss needs for further elucidation of different project aspects before decision-making or project realisation, when relevant.Upon completion of the degree work, the student shall have demonstrated such knowledge and ability as are required to work independently as a Master of Architecture/Master of Science in Engineering/ Master of Science.ContentThe task consists of independent work, which can be carried out individually or in pairs. The task includes topic selection, problem formulation and problem definition, literature studies, empirical data collection including practical experiments, development, preparation of a report as well as presentation and defense of the report at a seminar. The report must meet certain scientific criteria. The course also includes opposition on another group's thesis report.OrganisationInitiationThe thesis is to be written by a single student or two students working together.The student contacts an examiner or the master program responsible can suggest an examiner.The student formulates a brief written description of the topic for the thesis. The description should contain the background, purpose, objective and possibly the method.The examiner will ensure that the student and the project meet the requirements for general and specific prerequisites and the general intended learning outcomes for theses.The master program responsible ensures that the thesis falls within the main subject of the Master's programme. If the student is accepted in a five years program for Master of Science in Engineering or Architecture, the master program responsible should as well assess and approve that the master thesis is relevant for the appropriate technical/architectural subject area.The student submits information of the thesis project via the web form at Chalmer's education pages, Your studies. The examiner and the master program responsible sign their approval before registration in Ladok is done.PlanningThe student must write a planning report providing a detailed description of the problem/task. The planning report must contain the background, purpose, objective, scope, method and timetable for completion of the thesis. The planning report is submitted to the examiner for approval.SupervisionThe students are entitled to guidance during the course of their work.Written reportThe thesis must be written in English.The cover, etc., of the thesis must be formulated according to the instruction and templates at \"Design and Publish master Thesis\" at Chalmers. See Chalmers Education pages, Your studies.The thesis must be parsed using anti-plagiarism software.Chalmers' policies regarding open access and confidentiality apply to the work on the thesis and to publishing the report and the master thesis in whole should be open access.The thesis must be published electronically in Chalmers Open Digital Repository (ODR) Student theses according to the applicable rules for electronic publication of theses at Chalmers.When two students work jointly on a thesis, the division of the work must be clearly stated in the thesis.Oral presentationThe oral presentation begins with the student describing the work. This is followed by a defense of the findings, and a discussion.The oral presentation must be made in English. This presentation may not take more than 60 minutes, of which approximately 1/3 of the time should be devoted to a defense of the thesis and discussion.At the time of the oral presentation, the written thesis must be completed but not published. This is to make it possible to include viewpoints that arise during the oral presentation to be incorporated into the thesis.The oral presentation, including a defense of the thesis, must be done at Chalmers at an open seminar. Any additional presentations can be made at a company or other external organisations, if necessary. In exceptional cases, for example, if thesis research has been conducted abroad, the examiner may grant a dispensation from the requirement for an oral presentation, defense of the findings in the thesis and presence at other presentations at Chalmers.The presentation of the thesis must be announced at the department at least two weeks prior to the date of the presentation. The presentation must be held in the period between August 15 and June 15, during normal office hours.Additional information on the execution of the master thesis work can be available at the department.Examination including compulsory elementsFor a thesis to be approved, the following stages must be completed:An approved planning reportAn approved thesisAn approved presentation and defense of the thesisApproved opposition of another thesisAttendance of the presentation and defense of two other thesesThe course examiner may assess individual students in other ways than what is stated above if there are special reasons for doing so, for example if a student has a decision from Chalmers about disability study support.",
    "credits": 3.0,
    "course_type": "thesis",
    "url": "https://www.chalmers.se/en/education/your-studies/find-course-and-programme-syllabi/course-syllabus/MVEX03/",
    "scraped_date": "2025-12-09"
  }
]
